[
    {
        "id":288,
        "lastName":"Alex",
        "bio":"Dr Ben Alex is a Principal Software Engineer with SpringSource, and has been working professionally in software since 1995. Ben founded the Spring Security project in 2003 and led its development into a popular, open-source security framework that is used in numerous government, banking and military installations. More recently Ben founded and serves as lead of the Spring Roo and Spring Shell projects, both of which deliver significant productivity and usability benefits to those using Spring technologies.\r\n\r\nBen's career history also includes other roles in software development and business. From 2005 until 2008, he led the establishment and exponential growth of SpringSource's operations in Asia-Pacific. Prior to SpringSource, Ben founded and grew a successful Australian software company, Acegi Technology Pty Limited. He has been a director and advisor to businesses in diverse industries including business services, intellectual property licensing and ecommerce.\r\n\r\nIn recent years, Ben has presented at technology conferences including JavaOne, The Server Side Java Symposium, JAOO, Oredev, SpringOne and The Spring Experience. He is a regular guest presenter at user groups across the world, with recent appearances in Sydney, Melbourne, Brisbane, Canberra, Perth, Singapore, Wellington, Auckland, Christchurch and Stockholm. He also authored the security chapter of the Wiley book, \"Professional J2EE Development with Spring Framework,\" and maintains a blog at http://blog.springsource.com/main/author/bena/.",
        "company":"VMware (SpringSource)",
        "talks":[
            {
                "title":"Extreme Productivity with Spring Roo",
                "event":"University (3h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/341"
            },
            {
                "title":"Spring BOF",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/364"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/288/thumbnail.gif",
        "firstName":"Ben"
    },
    {
        "id":350,
        "lastName":"Algermissen",
        "bio":"Jan Algermissen is founder and principal consultant at NORD Software Consulting. NORD provides integration architecture management consulting to major publishing, legal and industrial companies. Jan's primary focus is the application of Web architecture to enterprise IT. Jan has been consulting and developing distributed systems for over 15 years and has been an expert for Web architecture for the last 8 years. Jan is author of numerous articles on REST and RESTful Web services and member of the JAX-RS (JSR 311) expert group and the Microsoft WCF HTTP advisory board.",
        "company":"NORD Software Consulting",
        "talks":[
            {
                "title":"The JAX-RS/REST BOF",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/358"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/350/thumbnail.jpg",
        "firstName":"Jan"
    },
    {
        "id":244,
        "lastName":"Allen",
        "bio":"Dan is the community liaison and member of the Seam, Weld and Arquillian project teams at JBoss, by Red Hat, the author of Seam in Action, a representative for Red Hat on the JSR-314 Expert Group (JSF 2.0) and a speaker at major industry conferences including JavaOne, Devoxx, NFJS, Jazoon and JSF Summit. He was inducted into the JavaOne Rock Star Hall of Fame for his talk about conversations and pageflows in JSF at JavaOne 2009.  Dan become deeply involved in Free and Open Source software (FOSS), namely Linux and Java enterprise frameworks, shortly after graduating from Cornell University. His passion for these technologies continue to drive him today. You can keep up with Dan's discoveries by subscribing to his blog at http://mojavelinux.com or follow what he's currently doing at http://twitter.com/mojavelinux.",
        "company":"Red Hat, Inc.",
        "talks":[
            {
                "title":"Seam 3: State of the Union",
                "event":"University (3h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/278"
            },
            {
                "title":"Seam Gathering",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/349"
            },
            {
                "title":"The roots of Java EE 6: JSR-299 (CDI) and Weld extensions",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/379"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/244/thumbnail.gif",
        "firstName":"Dan"
    },
    {
        "id":290,
        "lastName":"Almaer",
        "bio":"Director, Developer Relations at Palm",
        "company":"Palm",
        "talks":[
            {
                "title":"The State of the Web",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/342"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/290/thumbnail.gif",
        "firstName":"Dion"
    },
    {
        "id":292,
        "lastName":"Almeida",
        "bio":"Working for Caelum since 2008 as consultant, developer and instructor. Already talked on important events in Brazil, and participate on several open source projects, such as VRaptor and Restfulie. Also writes technical articles for the Brazilian magazine \"Mundo Java\". Nowadays also develops in Ruby and Rails. Loves to learn new stuffs everyday and share these new knowledges with others.",
        "company":"Caelum",
        "talks":[
            {
                "title":"Restfulie: quit pretending, use the web for real",
                "event":"Tools in Action (30m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/125"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/292/adrianoalmeida.jpg",
        "firstName":"Adriano"
    },
    {
        "id":5,
        "lastName":"Almiray",
        "bio":"Andres is a Java/Groovy developer with more than 10 years of experience in software design and development. He has been involved in web and desktop application development since the early days of Java. He is a true believer in open source and has participated on popular projects like Groovy, Griffon, and DbUnit, as well as starting his own projects (Json-lib, EZMorph, GraphicsBuilder, JideBuilder). Founding member of the Griffon framework. Andres maintains a blog at http://jroller.com/aalmiray",
        "company":"Canoo",
        "talks":[
            {
                "title":"A desktop app in minutes? Griffon to the rescue",
                "event":"Quickie (15m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/6"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/img/thumbnail.gif",
        "firstName":"Andres"
    },
    {
        "id":146,
        "lastName":"Arrenbrecht",
        "bio":"I am an independent Swiss software developer with extensive experience with core Java and in library and framework API design. I am project lead for http://formulacompiler.org/ and a fairly regular Mercurial contributor, as well as a proponent of literate testing (http://arrenbrecht.ch/testing/).",
        "company":"codewise.ch",
        "talks":[
            {
                "title":"Excel on the JVM: Generating Fast Code from Spreadsheet Models",
                "event":"Tools in Action (30m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/142"
            },
            {
                "title":"Literate Testing: Justifying APIs Makes Them Better",
                "event":"Tools in Action (30m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/144"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/146/thumbnail.gif",
        "firstName":"Peter"
    },
    {
        "id":27,
        "lastName":"Bachorik",
        "bio":"Jaroslav has got a MSc. degree in IT. He has started his professional IT career more than 10 years ago in 2008 working as a trainee in Norwegian leading BI and warehousing consultancy company, IC Group Norway. After the trial period he was given a position of junior developer and took care of analysis and implementation of smaller projects. After returning back to his home country he set up a developer workshop company (7 people) specialized mainly in DB oriented applications. Technologies varied from MS Access to J2EE application deployed on JBoss.  Basically, the company went bankrupt and he moved on. The next step was cca. 4 years spent in a company specialized on DMS solutions. He cycled between senior developer, analyst, architect and team lead positions so he had a chance to wear each hat. In the end he had the feeling he wanted to do something more \"tekkie\" and left for Sun Microsystems. Since 2006 he's been employed by Sun Microsystems as a senior software developer. He's taken part in various projects like NetBeans Profiler, VisualVM (jvisualvm) and JavaFX Editor support. He was driving his own projects like NetBeans JMeter integration and completely self standing project BTrace - together with its bindings for VisualVM and NetBeans.\r\n\r\nThis experience gives him insight to the whole line of software development - from requirements gathering and analysis, through design and implementation to performance management and application maintenance.",
        "company":"Sun Microsystems",
        "talks":[
            {
                "title":"VisualVM - multiplatform versatile monitoring solution",
                "event":"Tools in Action (30m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/115"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/27/thumbnail.gif",
        "firstName":"Jaroslav"
    },
    {
        "id":214,
        "lastName":"Baeyens",
        "bio":"Project Lead of Activiti, a new BPMN 2.0 process engine. Formerly founder of jBPM. Passionate about bringing BPM and workflow features in the hands of Java developers.",
        "company":"Alfresco",
        "talks":[
            {
                "title":"Activiti in Action",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/205"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/214/thumbnail.gif",
        "firstName":"Tom"
    },
    {
        "id":264,
        "lastName":"Bair",
        "bio":"Richard is a longtime speaker and member of the Swing Team at Sun Microsystems/Oracle. He has his roots as an application developer turned toolkit developer and is the lead of the component toolkit API for JavaFX. He is a frequent presenter and teams up frequently with other UI luminaries to produce demos for JavaOne and other conferences. As an application developer he had a specific penchant for databases and multi-tier design.",
        "company":"Oracle",
        "talks":[
            {
                "title":"From Shabby to Chic",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/293"
            },
            {
                "title":"JavaFX",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/295"
            },
            {
                "title":"JavaFX 101",
                "event":"University (3h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/296"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/264/thumbnail.gif",
        "firstName":"Richard"
    },
    {
        "id":31,
        "lastName":"Banon",
        "bio":"Founder of ElasticSearch, an Open Source, distributed, RESTful, Search Engine. \r\n\r\nDirector of Technology at GigaSpaces Technologies, a leading provider of a new generation of application platforms for Java and .Net environments. \r\n\r\nFounder of Compass, a Java Search Engine library built on top of Lucene.",
        "company":"NA",
        "talks":[
            {
                "title":"ElasticSearch - You Know, for Search",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/22"
            },
            {
                "title":"The NoSQL BOF",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/348"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/31/thumbnail.gif",
        "firstName":"Shay"
    },
    {
        "id":245,
        "lastName":"Barrez",
        "bio":"Joram Barrez is a senior software engineer at Alfresco. He started his career as a consultant, where he discovered the power of open-source BPM in Java. During one of his BPM evangelization talks, he met Tom, which eventually led to him joining JBoss/Red Hat. As a jBPM core developer, Joram was involved with the design and development of jBPM versions 3 and 4. Together with Tom, Joram recently joined Alfresco and the Activiti team.\r\n\r\nJoram is a devoted open-source BPM advocate, and never ceases to spread the message of the next generation in BPM through his blog and live presentations at JDD, Devoxx, JUGs, etc..",
        "company":"Alfresco",
        "talks":[
            {
                "title":"Activiti in Action",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/205"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/245/thumbnail.gif",
        "firstName":"Joram"
    },
    {
        "id":71,
        "lastName":"Baxter III",
        "bio":"Creator of PrettyFaces - Url Rewriting for JSF, PrettyTime  - Social-style date & time formatting for Java, and a community contributor to the JSF2 Expert Group; his latest project is ScrumShark, an open-source agile project management tool.\r\n\r\nBeginning his career in C, C++ development for hardware signal testing automation, Lincoln soon moved on to Perl, dynamic programming languages, artificial intelligence and, more recently - web application frameworks such as Java Server Faces and Groovy on Grails for financial and small business solutions.\r\n\r\nWhen he is not swimming, running, or playing Ultimate Frisbee, Lincoln is focused on improving the openness of Java, the Java Community Process(JCP), and bringing the J2EE platform to small businesses and freelancers.",
        "company":"Red Hat, Inc.",
        "talks":[
            {
                "title":"Beautiful Java EE: URL-rewriting for the next generation web-user",
                "event":"Tools in Action (30m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/59"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/71/thumbnail.gif",
        "firstName":"Lincoln"
    },
    {
        "id":117,
        "lastName":"Bernard",
        "bio":"After graduating from Supelec (French \"Grande Ecole\"), Emmanuel has spent a few years in the retail industry as developer and architect where he started to be involved in the ORM space. He joined the Hibernate team in 2003 and is now a lead developer and architect at JBoss, by Red Hat.\r\nEmmanuel is the lead developer of Hibernate Annotations and Hibernate EntityManager, two key projects on top of Hibernate Core implementing the Java Persistence(tm) specification. He also has founded and leads Hibernate Search and Hibernate Validator.\r\nEmmanuel is a member of the JPA 2.0 expert group and the spec lead of JSR 303: Bean Validation. He is a regular speaker at various conferences and JUGs, including JavaOne, JBoss World and Devoxx and the co-author of Hibernate Search in Action published by Manning.",
        "company":"JBoss by Red Hat",
        "talks":[
            {
                "title":"What's new in Hibernate: a JPA 2 perspective",
                "event":"University (3h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/92"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/117/thumbnail.gif",
        "firstName":"Emmanuel"
    },
    {
        "id":131,
        "lastName":"Bien",
        "bio":"Consultant and author Adam Bien (blog.adam-bien.com) is an Expert Group member for the Java EE 6, EJB 3.1, and JPA 2.0 JSRs. He has worked with Java technology since JDK 1.0 and Servlets/EJB 1.0 in several large-scale projects and is now an architect and developer in Java SE/EE/FX projects. He has edited several books about Java (FX) and J2EE / Java EE and is the author of Real World J2EE Patterns. Adam is a Java Champion and JavaOne 2009 Rock Star.",
        "company":"adam-bien.com",
        "talks":[
            {
                "title":"Creating Lightweight Applications With Nothing But Vanilla Java EE 6",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/121"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/131/thumbnail.gif",
        "firstName":"Adam"
    },
    {
        "id":314,
        "lastName":"Bloch",
        "bio":"Joshua Bloch is the Chief Java Architect at Google. Previously he was a Distinguished Engineer at Sun Microsystems and a Senior Systems Designer at Transarc. He led the design and implementation of numerous Java platform features, including the JDK 5.0 language enhancements and the Java Collections Framework. He holds a Ph.D. in Computer Science from Carnegie-Mellon University and a B.S. in Computer Science from Columbia University.",
        "company":"Google",
        "talks":[
            {
                "title":"Return of the Puzzlers",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/366"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/314/thumbnail.gif",
        "firstName":"Joshua"
    },
    {
        "id":296,
        "lastName":"Bodamer",
        "bio":"Roger heads the West Coast Operations for 10gen. He has over 20 years of experience of building and delivering great and innovative products to market and has deep expertise and knowledge of database architectures and internals. Roger holds several patents for database and middleware technology. His experience leading product development and engineering teams includes 12 years with Oracle's Database and Application Server development organization where he pioneered products that delivered heterogeneous interoperability, as well as several years as SVP of product operations and engineering at Apple's PowerSchool division. Roger also held leadership positions at OuterBay and Efficient Frontier. He earned a Bachelor's degree in computer science from the HogeSchool Enschede.",
        "company":"10gen.com",
        "talks":[
            {
                "title":"Building Web Applications with MongoDB",
                "event":"University (3h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/216"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/296/thumbnail.gif",
        "firstName":"Roger"
    },
    {
        "id":115,
        "lastName":"Buytaert",
        "bio":"Kris Buytaert is a long time Linux and Open Source Consultant doing Linux and Open Source projects in Belgium , Europe and the rest of the universe. He is currently working for Inuits\r\n\r\nKris is the Co-Author of Virtualization with Xen ,used to be the maintainer of the openMosix HOWTO and author of different technical publications. He is a frequent speaker at different international conferences.\r\n\r\nHe spends most of his time working on Linux Clustering (both High Availability, Scalability and HPC), Virtualisation and Large Infrastructure Management projects hence trying to build infrastructures that can survive the 10th floor test, better known today as the cloud.\r\n\r\nHis blog titled \"Everything is a Freaking DNS Problem\" can be found at http://www.krisbuytaert.be/blog/",
        "company":"Inuits",
        "talks":[
            {
                "title":"From Dev/Ops to DevOps. Amazing the difference one character can make.",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/229"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/115/thumbnail.gif",
        "firstName":"Kris"
    },
    {
        "id":331,
        "lastName":"Chaize",
        "bio":"Michaël Chaize is a Flash Platform Evangelist at Adobe where he focuses on Rich Internet Application and Enterprise Integration. Based in Paris, he works with large accounts that need to understand the benefits of rich user interfaces, leverage the existing back-ends to add a rich presentation layer and measure the impact on the existing IT teams. He believes that intuitive user experiences in the Enterprise are key to successful developments of effective, efficient, engaging, easy to learn and error free applications. He loves to promote concepts such as “Productivity by design” or “User Experience oriented architectures”. In his previous role, Michael worked as a Technical Sales in France and assumed the promotion of the Flash Platform in front of large audiences of developers and IT managers. Before joining Adobe, Michael founded a software company and taught RIA languages such as Flex and PHP in IT engineering schools.",
        "company":"Adobe Systems",
        "talks":[
            {
                "title":"The latest innovations of the Adobe Flash Platform for Java developers",
                "event":"University (3h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/368"
            },
            {
                "title":"Meet the Adobe guys and discuss the role of RIA in the Enterprise",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/370"
            },
            {
                "title":"Develop Mobile applications with AIR 2.5",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/371"
            },
            {
                "title":"Fun and visual effects with Flex 4",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/372"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/331/thumbnail.gif",
        "firstName":"Michael"
    },
    {
        "id":195,
        "lastName":"Champenois",
        "bio":"Ludovic Champenois is one of the architects of the GlassFish Java EE 6 Application Server, a modular, elegant application server, based on OSGi and exposing the latest technologies of the Enterprise Platform: JPA2, JSF 2, CDI, Beans Validations, Servlet 3.0 etc.\r\nHis main focus is around providing Tools for the EE platform (both NetBEans and Eclipse advanced plugins) as well as the REST Admin backend of GlassFish which expose all the adminstration capabilities of the server via a comprehensive JAX-RS REST style URLs allowing clients like the Admin console or other clients (JavaScript, JavaFX, PHP) to easily access to the admin backend.",
        "company":"Oracle",
        "talks":[
            {
                "title":"Java EE 6: Tooling Status: what am I missing?",
                "event":"Tools in Action (30m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/186"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/195/thumbnail.gif",
        "firstName":"Ludovic"
    },
    {
        "id":98,
        "lastName":"Chin",
        "bio":"Stephen Chin is Director of SW Engineering at Inovis by day and an open-source developer and author by night. He has been working with Java desktop and enterprise technologies for over a decade, and was voted in to the Java Champions group for his contributions to the community. Stephen's interest in RIA technology lead him to coauthor the Pro JavaFX Platform book together with Jim Weaver, Weiqi Gao, and Dean Iverson. Stephen also founded the Silicon Valley JavaFX User Group, which streams monthly presentations live and receives tens of thousands of online views. He is also a recognized international speaker on JavaFX technology and was named a 2009 JavaOne Rock Star. For more information about the presenter, see his blog at: http://steveonjava.com/",
        "company":"Inovis",
        "talks":[
            {
                "title":"JavaFX Your Way: Building JavaFX Applications with Alternative Languages",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/376"
            },
            {
                "title":"Visage Android Workshop",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/377"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/98/thumbnail.gif",
        "firstName":"Stephen"
    },
    {
        "id":275,
        "lastName":"Chinnici",
        "bio":"Roberto Chinnici is a senior staff engineer at Sun Microsystems, Inc. and the specification lead for the Java Platform Enterprise Edition 6. Previously he was the specification lead for JAX-WS 2.0 and JAX-RPC 1.1 and an active participant in W3C and WS-I working groups.",
        "company":"Oracle",
        "talks":[
            {
                "title":"The Future Roadmap of Java EE",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/326"
            },
            {
                "title":"Java EE 7",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/327"
            },
            {
                "title":"The JavaEE BOF",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/354"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/275/thumbnail.gif",
        "firstName":"Roberto"
    },
    {
        "id":326,
        "lastName":"Cimadamore",
        "bio":"Main focus on type-system area of javac/javafxc compilers, improving generics/wildcards support (actively improving JLS coverage in that area), improving javac error messages and enhancing interoperability between JavaFX and Java",
        "company":"oracle",
        "talks":[
            {
                "title":"Project Coin: Small Language Changes in JDK 7",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/337"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/326/thumbnail.gif",
        "firstName":"Maurizio"
    },
    {
        "id":254,
        "lastName":"Cole",
        "bio":"I'm a habitual tinkerer on a mission for smart IT. I've started my career at the age of 16, integrating Intel machines and Novell networks. Several years back, I got involved in Java and started writing mass system automation and deployment software. jclouds is an open source expression of my experience to date.\r\n\r\nMy goal is to make the cloud as easy and portable as the mobile phone network.",
        "company":"Opscode, Inc.",
        "talks":[
            {
                "title":"Clustering the clouds in java",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/357"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/254/thumbnail.gif",
        "firstName":"Adrian"
    },
    {
        "id":167,
        "lastName":"Cote",
        "bio":"Coté is analyst at RedMonk covering primarily enterprise software, specializing\r\nin open source, cloud computing, IT management, software development, collaborative, the web, emerging technologies, new media, and\r\nsocial/collaborative software. He is RedMonk’s IT Management Lead. His blog is available at http://www.PeopleOverProcess.com and he produces the RedMonk podcast as well as the video podcast RedMonkTV.\r\n\r\nBefore joining RedMonk, Coté worked at BMC developing the BMC Performance\r\nManager family of enterprise systems management products. Prior to BMC, Cote’ worked at a wide variety of tech companies and startups such as The Cobalt Group, Coral Technologies, and one of the first, and still thriving, online banking companies, FundsXpress. He also produces the popular code monkey podcast, DrunkAndRetired.com.\r\n\r\nCoté was selected for the Texas Social Media Awards in 2009. Technobabble 2.0, a popular blog about analyst relations, ranked Coté’s blog #14 in its ranking of the top 400 analyst blogs (in 2008, he was ranked #8 of the “Top 100 analyst blogs”). He was recently named the 3rd most regarded analyst in the U.S. and 5th globally by the Institute of Industry Analyst Relations. (Thanks!) He talks with and is quoted by the tech press frequently.",
        "company":"RedMonk",
        "talks":[
            {
                "title":"Does dev/ops matter for me?",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/168"
            },
            {
                "title":"Pragmatic Cloud Computing, or, Dealing with Morlocks, or, Agile Infrastructure",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/169"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/167/thumbnail.gif",
        "firstName":"Michael"
    },
    {
        "id":282,
        "lastName":"Darcy",
        "bio":"Joe is currently the lead engineer of Project Coin, the effort to select and implement a set of small Java language changes for JDK 7. He also serves as a member of the JDK 7 release team. Concurrently, Joe continues to be the release manager, lead engineer, and quality lead for OpenJDK 6, an open source implementation of the Java SE 6 platform.A longtime member of the JDK engineering group, Joe was previously specification lead for JSR 269, the Pluggable Annotation Processing API, which delivered a standardized annotation processing API and mirror-based language model into JDK 6 to supersede the earlier apt tool from JDK 5. Joe assisted in implementing the JDK 5 language changes with work spanning core reflection, javac hacking, and general library support.\r\n\r\nJoe holds a master's degree in computer science from UC Berkeley and a master's degree in applied math from Stanford University.",
        "company":"Oracle",
        "talks":[
            {
                "title":"Project Coin: Small Language Changes in JDK 7",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/337"
            },
            {
                "title":"The state of Java SE 7",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/355"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/282/thumbnail.gif",
        "firstName":"Joe"
    },
    {
        "id":56,
        "lastName":"Dashorst",
        "bio":"Martijn Dashorst is a senior software engineer for Topicus B.V.. He is a committer on the Wicket project and works on many Wicket related projects. When he doesn't work with or on Wicket, he likes to spend time with his girlfriend and two cats.",
        "company":"Topicus Onderwijs",
        "talks":[
            {
                "title":"Introducing Wicket",
                "event":"University (3h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/291"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/56/thumbnail.gif",
        "firstName":"Martijn"
    },
    {
        "id":309,
        "lastName":"De Bruijn",
        "bio":"Franck De Bruijn has been active in the development of enterprise administration software for all his professional life (> 13 years). He worked for companies like Ericsson, UPS Logistics and Logica learning the ropes by passing through a variety of roles: developer, software architect, information analyst and IT manager (see also http://nl.linkedin.com/in/franckdebruijn).\r\n\r\nFor many years, Franck has studied all aspects of the development of multi-channel purpose-built enterprise administration systems. This resulted in the creation of the Festa Factory platform, which has been put into practice successfully since 2008 for 2 customers. Excited by these results, Franck now aims to bring the Festa Factory as open source product to the JAVA/JEE community.",
        "company":"Festa Factory BV",
        "talks":[
            {
                "title":"Festa Factory: Unmatched Productivity",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/365"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/img/thumbnail.gif",
        "firstName":"Franck"
    },
    {
        "id":205,
        "lastName":"Debois",
        "bio":"In order to understand current IT organizations, Patrick has taken a habit of changing both his consultancy role and the domain which he works in: sometimes as a developer, manager, sysadmin, tester and even as the customer.\r\n\r\nDuring 15 years of consultancy, there is one thing that annoys him badly, it is the great divide between all these groups. But times are changing now: being a player on the market requires you to get these ‘battles’ under control between these silos.\r\n\r\nHe first presented concepts on Agile Infrastructure at Agile 2008 in Toronto, and in 2009 he organized the first devopsdays . Since then he has been promoting the notion of ‘devops’ to exchange ideas between these groups and show how they can help each other to achieve better results in business.",
        "company":"jedi bvba",
        "talks":[
            {
                "title":"From Dev/Ops to DevOps. Amazing the difference one character can make.",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/229"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/205/thumbnail.gif",
        "firstName":"Patrick"
    },
    {
        "id":197,
        "lastName":"DeMichiel",
        "bio":"Linda DeMichiel is a senior architect in the Java EE Platform group at Sun Microsystems and specification lead for Java Persistence 2.0 under the Java Community Process (JCP). As the former specification lead of JSR 220, she was responsible for launching and leading the initiative for EJB 3.0 and Java Persistence API, and was recognized as the 2006 Java Community Process Outstanding Spec Lead for Java SE/EE for her leadership in this work. \n\nLinda has over 20 years of experience in the areas of databases, object persistence, and distributed computing. Before assuming responsibility for EJB, she led the team that implemented Sun's first object/relational persistence product, and worked earlier at IBM on object/relational extensions to both DB2 and the SQL99 standard. She holds a Ph.D. in Computer Science from Stanford University.",
        "company":"Oracle",
        "talks":[
            {
                "title":"Java Persistence 2.0",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/285"
            },
            {
                "title":"The Java Persistence Criteria API",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/286"
            },
            {
                "title":"JPA Futures",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/287"
            },
            {
                "title":"The JavaEE BOF",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/354"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/197/thumbnail.gif",
        "firstName":"Linda"
    },
    {
        "id":325,
        "lastName":"Diaz",
        "bio":"TODO",
        "company":"Sfeir",
        "talks":[
            {
                "title":"GWT and App Engine using the Devoxx REST Interface",
                "event":"Quickie (15m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/367"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/325/IMG_0121.JPG",
        "firstName":"Salvador"
    },
    {
        "id":308,
        "lastName":"Dodson",
        "bio":"Virgil Dodson is a Developer Evangelist at Actuate Corporation and blogger/forum moderator at BIRT Exchange.  Virgil has over 14 years experience as a software developer.  For the past 7 years he has helped Java developers get started with Actuate's embedded reporting products.  He holds a Bachelor of Science degree in Computer Information Systems from DeVry.",
        "company":"Actuate Corporation",
        "talks":[
            {
                "title":"BIRT in Action: Adding Interactivity Features to your BIRT Reports",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/363"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/308/virgil_head_100x110.jpg",
        "firstName":"Virgil"
    },
    {
        "id":32,
        "lastName":"Drost",
        "bio":"Isabel Drost is member of the Apache Software Foundation. She is organiser of the Apache Hadoop Get Together in Berlin, was co-organiser of the NoSQL meetup as well as the Berlin Buzzwords 2010 scalability conference. She co-founded Apache Mahout and is active Mahout committer. Isabel is actively engaged with communities of various Apache projects, e.g. Lucene and Hadoop. She is regular speaker at renown conferences on topics related to free software development, scalability, Lucene, Hadoop and Mahout.",
        "company":"ASF",
        "talks":[
            {
                "title":"Intelligent data analysis - Apache Mahout",
                "event":"Tools in Action (30m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/45"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/32/thumbnail.gif",
        "firstName":"Isabel"
    },
    {
        "id":159,
        "lastName":"Dupuis",
        "bio":"Christian is a Principal Software Engineer for SpringSource and is the leader of the Tools Team responsible for SpringSource development tools including SpringSource Tool Suite. Since 2004 Christian has led the well known Spring IDE open source project that provides development tools for the Spring Portfolio based on Eclipse.\r\n\r\nChristian has been developing Java enterprise applications since 1997. During this time, Christian designed complex software architectures with a focus on multi-tiered, web-based, client-server applications using enterprise Java technologies and the Spring Framework. Prior to joining SpringSource, Christian worked as consultant and project manager for one of the leading global technology consulting firms in the financial sector in central Europe.",
        "company":"SpringSource",
        "talks":[
            {
                "title":"Spring Developer Tools to push your Productivity",
                "event":"Tools in Action (30m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/164"
            },
            {
                "title":"Groovy/Grails Development in Eclipse",
                "event":"Tools in Action (30m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/165"
            },
            {
                "title":"Spring BOF",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/364"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/159/thumbnail.gif",
        "firstName":"Christian"
    },
    {
        "id":157,
        "lastName":"Ellis",
        "bio":"Jonathan is project chair of Apache Cassandra and co-founder of Riptano, the source for professional Cassandra support.",
        "company":"Riptano",
        "talks":[
            {
                "title":"Cassandra by Example",
                "event":"University (3h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/161"
            },
            {
                "title":"Introduction to Cassandra",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/162"
            },
            {
                "title":"The NoSQL BOF",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/348"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/157/thumbnail.gif",
        "firstName":"Jonathan"
    },
    {
        "id":266,
        "lastName":"Feinberg",
        "bio":"Alex Feinberg is a Senior Software Engineer in the Search, Network and Analytics Team at LinkedIn, working on Project Voldemort. In the past he's done systems programming in the contexts of large scale operations automation, ad serving systems and email security.",
        "company":"LinkedIn",
        "talks":[
            {
                "title":"Project Voldemort - Reliable distributed storage",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/299"
            },
            {
                "title":"The NoSQL BOF",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/348"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/266/thumbnail.gif",
        "firstName":"Alex"
    },
    {
        "id":276,
        "lastName":"Ford",
        "bio":"Neal Ford is Software Architect and Meme Wrangler at ThoughtWorks, a global IT consultancy with an exclusive focus on end-to-end software development and delivery. He is also the designer and developer of applications, instructional materials, magazine articles, courseware, video/DVD presentations, and author and/or editor of 6 books spanning a variety of technologies, including the most recent The Productive Programmer. He focuses on designing and building of large-scale enterprise applications. He is also an internationally acclaimed speaker, speaking at over 100 developer conferences worldwide, delivering more than 600 talks. Check out his web site at http://www.nealford.com. He welcomes feedback and can be reached at nford@thoughtworks.com.",
        "company":"ThoughtWorks Inc",
        "talks":[
            {
                "title":"Productive Programmer",
                "event":"University (3h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/328"
            },
            {
                "title":"Implementing Emergent Design",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/329"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/276/thumbnail.gif",
        "firstName":"Neal"
    },
    {
        "id":271,
        "lastName":"Freeman",
        "bio":"Steve was a pioneer of Agile software development in the UK, he has built applications for banks, ISPs, financial data providers, and specialist software companies. He has given training courses in Europe, America, and Asia.\r\n\r\nPreviously, he worked in research labs, software houses, earned a PhD, and wrote shrink-wrap software for IBM. Steve also teaches in the Computer Science department at University College London. He is a presenter and organizer at international industry conferences, and was conference chair for the first London XpDay.",
        "company":"M3P",
        "talks":[
            {
                "title":"Fractal TDD - Using tests to drive system design",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/347"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/271/thumbnail.gif",
        "firstName":"Steve"
    },
    {
        "id":291,
        "lastName":"Galbraith",
        "bio":"Ben Galbraith is the director of developer relations at Palm and the co-founder of Ajaxian.com. Ben has long juggled interests in both business and tech, having written his first computer program at six years old, started his first business at ten, and entered the IT workforce at twelve. He has delivered hundreds of technical presentations world-wide, produced several technical conferences, and co-authored over a half-dozen books. He has enjoyed a variety of business and technical roles throughout his career, including CEO, CIO, CTO, and Chief Software Architect roles in medical, publishing, media, manufacturing, advertising, software and internet industries. He lives in Palo Alto with his wife and five children.",
        "company":"Palm",
        "talks":[
            {
                "title":"The State of the Web",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/342"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/291/thumbnail.gif",
        "firstName":"Ben"
    },
    {
        "id":231,
        "lastName":"Geary",
        "bio":"A prominent author, speaker, and consultant, David holds a unique qualification as a Java expert: He wrote the best-selling books on both Java component frameworks: Swing and JavaServer Faces (JSF). David's Graphic Java Swing was one of the best-selling Java books of all time and Core JSF, which David wrote with Cay Horstman (the co-author of Core Java), is the best-selling book on JavaServer Faces. David has also written books on Advanced JSP, the JSP Standard Tag Library, and the Google Web Toolkit.\r\nDavid is a member of the JSF 2 Expert Group, helping to define the next generation of JavaServer Faces. David was on the original JSF 1 Expert Group after working at Sun in the mid 1990s. Besides serving on the JSF and JSTL Expert Groups, David has contributed to open-source projects and co-authored Sun's Web Developer Certification Exam. He invented the Struts Template library which was the precursor to Tiles, a popular framework for composing web pages from JSP fragments, and was the 2nd Struts committer.\r\n\r\nDavid is a professional speaker and presenter who spends more than 200 hours/year speaking at conferences, including the No Fluff Just Stuff tour (about 20 symposiums per year), Javapolis, The ServerSide Symposium, QCon, and JavaOne. David is a charismatic and enthusiastic speaker who gives presentations with style, flair, and is well-known for his sense of humor. Not only does David do a masterful job of making complicated technical topics easily understood, but his presentations are full of technical nuggets, sizzling demos, and are great fun to attend.\r\n\r\nDavid has been nominated a JavaOne Rock Star three times, for his presentations in 2005, 2006, and 2009.",
        "company":"Clarity Training, Inc.",
        "talks":[
            {
                "title":"Google Web Toolkit, Take 2: Implementing Awesome Rich Internet Applications",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/244"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/231/thumbnail.gif",
        "firstName":"David"
    },
    {
        "id":54,
        "lastName":"Gierke",
        "bio":"Oliver Gierke is Senior Consultant at Spring Source - a division of VMware. He has been into Java Application development and according OpenSource projects for over 5 years now. His work focuses around enterprise Java development, mostly based on Spring and other OpenSource technologies. He is project lead of OpenSource projects Hades and Hera.",
        "company":"SpringSource - a division of VMware",
        "talks":[
            {
                "title":"Increasing developer productivity with Mylyn",
                "event":"Tools in Action (30m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/39"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/54/thumbnail.gif",
        "firstName":"Oliver"
    },
    {
        "id":283,
        "lastName":"Goetz",
        "bio":"Brian Goetz has been a professional software developer for more than twenty years. Brian is the author of the very successful 'Java Concurrency in Practice', and has written over 75 articles on Java development. He is one of the primary members of the Java Community Process JSR 166 Expert Group (Concurrency Utilities), and has served on numerous other JCP Expert Groups. Brian is a Sr. Staff Engineer at Sun Microsystems.",
        "company":"Oracle",
        "talks":[
            {
                "title":"Project Lambda: To Multicore and Beyond",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/345"
            },
            {
                "title":"The state of Java SE 7",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/355"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/283/thumbnail.gif",
        "firstName":"Brian"
    },
    {
        "id":116,
        "lastName":"Goncalves",
        "bio":"Antonio is a senior software architect specialized in Java/Java EE. As a consultant he advises customers in France and help them in defining their software architecture. Antonio is also the founder of the very successful Paris JUG and independent JCP member on JEE6 (JSR 316), JPA 2.0 (JSR 317) and EJB 3.1 (JSR 318). Based on all his experiences, he has written two books about Java EE 5 and recently on Java EE 6 with Glassfish. It explains, in a practical way, how to develop an application using most of the Java EE specifications.",
        "company":"AGInc",
        "talks":[
            {
                "title":"Java EE 6 Tutorial. Reloaded!",
                "event":"University (3h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/134"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/116/thumbnail.gif",
        "firstName":"Antonio"
    },
    {
        "id":306,
        "lastName":"Gosling",
        "bio":"James Gosling received a B.Sc in Computer Science from the University of Calgary. In 1983, he earned a Ph.D in Computer Science from Carnegie Mellon University, and his doctoral thesis was titled \"The Algebraic Manipulation of Constraints\". While working towards his doctorate, he wrote a version of emacs (gosmacs), and before joining Sun Microsystems he built a multi-processor version of Unix while at Carnegie Mellon University, as well as several compilers and mail systems.\r\n\r\nBetween 1984 and 2010, Gosling was with Sun Microsystems. He is known as the father of the Java programming language. On April 2, 2010, Gosling left Sun Microsystems which had recently been acquired by the Oracle.",
        "company":"na",
        "talks":[
            {
                "title":"Java: The State of the Union",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/361"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/306/thumbnail.gif",
        "firstName":"James"
    },
    {
        "id":177,
        "lastName":"Gray",
        "bio":"Michael is an HBase committer and a member of the Hadoop project management committee.  He works at StumbleUpon",
        "company":"Facebook",
        "talks":[
            {
                "title":"Introduction to HBase",
                "event":"University (3h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/208"
            },
            {
                "title":"Hadoop, HBase, and Hive in Production",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/283"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/177/thumbnail.gif",
        "firstName":"Jonathan"
    },
    {
        "id":132,
        "lastName":"Guy",
        "bio":"Romain Guy is a software engineer at Google. After spending years having fun with large UIs on the desktop and talking about them at conferences, in blogs, magazines and books, Romain decided to go for the small screen and joined the Android project, an Open Source operating system for mobile phones. He's now trying to make mobile phone UIs as fun and exciting as desktop ones.",
        "company":"Google",
        "talks":[
            {
                "title":"Android Graphics and Animations",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/126"
            },
            {
                "title":"Dive into Android",
                "event":"University (3h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/133"
            },
            {
                "title":"Android Q&A",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/351"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/132/thumbnail.gif",
        "firstName":"Romain"
    },
    {
        "id":129,
        "lastName":"Haase",
        "bio":"Chet is a graphics geek. He has worked across the industry on various platforms and technologies that put the pixels on the screen. He worked on the Java desktop library at Sun Microsystems, on Java2D, Swing, and animation. He worked on the Flex SDK team at Adobe, writing the effects framework for Flex 4. And he now works at Google on the Android project.\r\nChet is a frequent speaker at conferences such as Devoxx and JavaOne, on topics ranging from graphics to, well, graphics.\r\nChet is the author of the book \"Flex 4 Fun,\" about the graphical and animated side of the Flex 4 SDK.\r\nChet is the co-author, with Romain Guy, of Filthy Rich Clients: Developing Animated and Graphical Effects for Java Desktop applications.\r\nFinally, and irrelevantly, Chet also wrote the book \"When I am King...\", based on his comedy blog writings at http://chetchat.blogspot.com.",
        "company":"Google",
        "talks":[
            {
                "title":"Android Graphics and Animations",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/126"
            },
            {
                "title":"Dive into Android",
                "event":"University (3h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/133"
            },
            {
                "title":"Android Q&A",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/351"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/129/thumbnail.gif",
        "firstName":"Chet"
    },
    {
        "id":67,
        "lastName":"Hoeller",
        "bio":"Juergen Hoeller is co-founder of the Spring Framework project and Principal Engineer at SpringSource, a division of VMware, where he continues to lead the development of the core framework. Juergen is an experienced software architect and consultant with outstanding expertise in transaction management, O/R mapping technologies and enterprise messaging. Juergen is co-author of the bestselling book \"Expert 1-on-1 J2EE Development without EJB\" and regularly speaks at international technology conferences.",
        "company":"SpringSource, a division of VMware",
        "talks":[
            {
                "title":"Spring 3.1 - Themes and Trends",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/56"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/67/thumbnail.gif",
        "firstName":"Juergen"
    },
    {
        "id":299,
        "lastName":"Ibsen",
        "bio":"Claus Ibsen is a full time Apache Camel committer, employed by FuseSource. He is also co-author of the Camel in Action book.",
        "company":"FuseSource",
        "talks":[
            {
                "title":"Apache Camel, a powerful open source integration framework",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/356"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/299/thumbnail.gif",
        "firstName":"Claus"
    },
    {
        "id":63,
        "lastName":"Jacobi",
        "bio":"Jonas is the co-founder of Kaazing and loves the fact that software is limitless. Before co-founding Kaazing Jonas worked as VP of Product Management responsible for the product management and strategy for Brane Corporation, a startup company in Silicon Valley. Prior to Brane Corporation, he worked 8 years for Oracle as a Java EE Evangelist and product manager responsible for the product management of JavaServer Faces, Oracle ADF Faces, and Oracle ADF Faces Rich Client in the Oracle JDeveloper team. A native of Sweden, Jonas has worked in the software industry for more than sixteen years. \r\n\r\nJonas is a frequent speaker at international conferences and has written numerous articles for leading IT magazines such as Java Developer's Journal, JavaPro, AjaxWorld, and Oracle Magazine. Jonas is co-author of the book Pro JSF and Ajax: Building Rich Internet Components, (Apress).",
        "company":"Kaazing",
        "talks":[
            {
                "title":"HTML5 Websockets: A New World of Limitless, Live, and Wickedly Cool Web Applications",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/49"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/63/jonas.png",
        "firstName":"Jonas"
    },
    {
        "id":2,
        "lastName":"Janssen",
        "bio":"Stephan Janssen is a serial entrepreneur that has founded several successful organizations such as the Belgian Java User Group (BeJUG) in 1996, JCS Int. in 1998, JavaPolis in 2002 and now Parleys.com in 2006. He has been using Java since its early releases in 1995 with experience of developing and implementing real world Java solutions in the finance and manufacturing industries. Today Stephan is the CTO of the Java Competence Center at RealDolmen. He was selected by BEA Systems as the first European (independent) BEA Technical Director. He has also been recognized by the Server Side as one of the 54 Who is Who in Enterprise Java 2004. Sun has recognized in 2005 his efforts for the Java Community and has engaged him in the Java Champion project. He has spoken at numerous Java and JUG conferences around the world.",
        "company":"Devoxx",
        "talks":[
            {
                "title":"The annual Java User Group BOF",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/319"
            },
            {
                "title":"Welcome and Intro",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/332"
            },
            {
                "title":"What's new in Parleys.com Version 4",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/353"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/2/thumbnail.gif",
        "firstName":"Stephan"
    },
    {
        "id":101,
        "lastName":"Junnarkar",
        "bio":"Nilesh is a Senior Manager at Oracle, managing Web services and SOA platform development team as part of Web Logic Server. He also manages Web Services Interoperability program at Oracle. He has 16+ years of extensive experience and has been involved with application server design and development efforts involving Java EE technology ,XML and Web services technologies. His interests include XML, Web services interoperability and Caching related areas",
        "company":"Oracle",
        "talks":[
            {
                "title":"Dealing with Asynchronicity in Java™ Technology-Based Web Services",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/71"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/101/thumbnail.gif",
        "firstName":"Nilesh"
    },
    {
        "id":142,
        "lastName":"Kabanov",
        "bio":"Jevgeni Kabanov is the founder and CTO of ZeroTurnaround (www.zeroturnaround.com), a development tools company that focuses on productivity.  Before that he worked as the R&D director of Webmedia, Ltd, the largest custom software development company in the Baltics. As part of the effort to reduce development time tunraround he wrote the prototype of the ZeroTurnaround flagship product, JRebel, a class reloading JVM plugin.\r\n\r\nJevgeni has been speaking at international conferences for over 5 years, including JavaPolis/Devoxx, JavaZone, JAOO, QCon, TSSJS, JFokus and so on. He also has an active research interest, publishing several papers on topics ranging from category theoretical notions to typesafe Java DSLs.\r\n\r\nBesides the commercial products made for ZeroTurnaround, Jevgeni is a co-founder of two open-source projects -- Aranea and Squill. Aranea (www.araneaframework.org) is a web development and integration platform based on strong object-oriented principles. Squill (squill.dev.java.net) is a typesafe internal DSL for constructing and executing SQL queries.\r\n\r\nYou can follow Jevgeni on Twitter as @ekabanov.",
        "company":"ZeroTurnaround OÜ",
        "talks":[
            {
                "title":"Instant Updates and Rollbacks in Production Applications",
                "event":"Quickie (15m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/140"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/img/thumbnail.gif",
        "firstName":"Jevgeni"
    },
    {
        "id":265,
        "lastName":"Kabutz",
        "bio":"Another geek, another bio.  Here I am supposed to write how great I am :-)  Instead, I would rather like to thank YOU for your support these last 10 years by reading the Java Specialists' Newsletter.  The Java community with its vibrancy has rewarded me over and over with intellectually stimulating ideas.  For this I thank you, the Java user.",
        "company":"Javaspecialists.eu",
        "talks":[
            {
                "title":"10 Years of The Java Specialists' Newsletter",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/297"
            },
            {
                "title":"Reflection Madness",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/298"
            },
            {
                "title":"jpatterns.org - Annotations for Pointing out Patterns in Your Code",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/359"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/265/thumbnail.gif",
        "firstName":"Heinz"
    },
    {
        "id":124,
        "lastName":"Katz",
        "bio":"Max Katz is a Senior Systems Engineer and Lead RIA Strategist at Exadel. He has been helping customers jump-start their RIA development as well as providing mentoring, consulting, and training. Max is a recognized subject matter expert in the JSF developer community. He has provided JSF/RichFaces training for the past 6 years, presented at many conferences, and written several published articles on JSF-related topics. Max leads Exadel’s RIA strategy, and oversees a number of open source projects such as Exadel JavaFX Plug-in for Eclipse and Fiji. Max writes about RIA technologies in his blog, http://mkblog.exadel.com, and can be found on Twitter at http://twitter.com/maxkatz. He is an author of “Practical RichFaces” book (Apress). Max holds a BS in computer science from the University of California, Davis.",
        "company":"Exadel",
        "talks":[
            {
                "title":"Mobile Development Choices: Native Apps vs. Web Apps",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/374"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/124/thumbnail.gif",
        "firstName":"Max"
    },
    {
        "id":6,
        "lastName":"Laforge",
        "bio":"Guillaume Laforge is the project lead of Groovy, the highly popular and successful dynamic language for the JVM. He co-authored Manning's best seller \"Groovy in Action\" with Dierk König, and is working for SpringSource (a division of VMWare) where he's working full time on cool and Groovy stuff. Guillaume worked hand in hand with the Google App Engine Java team before the official launch of the new platform to ensure that Groovy would run well on this new cloud. With this background in mind, he created Gaelyk, a lightweight toolkit for developing applications written in Groovy on Google App Engine, that he demonstrated at the Google I/O 2009 Conference. ou can meet Guillaume at conferences around the world where he evangelizes the Groovy dynamic language, Domain-Specific Languages in Groovy, and the agile Grails web framework.",
        "company":"SpringSource",
        "talks":[
            {
                "title":"Groovy update, ecosystem, and skyrocketing to the cloud with App Engine and Gaelyk!",
                "event":"University (3h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/284"
            },
            {
                "title":"Groovy/Grails Get Together",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/350"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/6/thumbnail.gif",
        "firstName":"Guillaume"
    },
    {
        "id":242,
        "lastName":"Lahoda",
        "bio":"In software business since 1985, designed a large number of successful solutions for various needs and customers. Found his second mother tongue in Java in 1995 and never looked back. In last few years found his niche in software for the mobile people and the interconnection of mobile application with the rest of the world. Despite of the number of projects finished, still gets excited when someone says “gee, it just works”",
        "company":"Perpetum Design",
        "talks":[
            {
                "title":"Programatic UI - how to build UI and avoid acute chevronitis",
                "event":"Tools in Action (30m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/276"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/242/pl_headshot.png",
        "firstName":"Pavel"
    },
    {
        "id":37,
        "lastName":"Leau",
        "bio":"Costin is a senior software engineer at SpringSource, VMware. His interests include data access and aspect oriented programming.\r\nWith significant development experience, Costin is involved in the development of Spring framework, Pitchfork, Spring Modules and Spring JavaConfig. Leads Spring Dynamic Modules (Spring OSGi) project and the Spring-inspired, OSGi 4.2 Blueprint Service RI.\r\n\r\nSpeaker at various editions of EclipseCon/OSGi DevCon, Javapolis, JavaZone, SpringOne, SpringOne2GX, TSSJS, TSE on Java/Spring/OSGi related topics.",
        "company":"SpringSource, division of VMware",
        "talks":[
            {
                "title":"Spring 3 Java Config",
                "event":"Quickie (15m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/28"
            },
            {
                "title":"Standard DI with @Inject and JSR-330",
                "event":"Quickie (15m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/29"
            },
            {
                "title":"Improve the performance of your Spring app",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/180"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/37/thumbnail.gif",
        "firstName":"Costin"
    },
    {
        "id":133,
        "lastName":"Lehene",
        "bio":"Cosmin Lehene is a computer scientist at Adobe Systems working on infrastructure services with focus on distributed storage and processing. He is a contributor to Apache HBase and Hadoop projects and is one of the main advocates of these technologies inside Adobe. In 2010 he started the http://hstack.org - a team blog about the Hadoop software stack.",
        "company":"Adobe Systems",
        "talks":[
            {
                "title":"Big Data with HBase and Hadoop at Adobe",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/259"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/133/thumbnail.gif",
        "firstName":"Cosmin"
    },
    {
        "id":240,
        "lastName":"Lehtinen",
        "bio":"Joonas Lehtinen is one of the core developers of Vaadin, a Java-based framework for building business-oriented Rich Internet Applications (RIAs). Joonas has been developing applications for the web since 1995 with a strong focus on Ajax and Java. He is the founder and CEO of Vaadin Ltd.",
        "company":"Vaadin Ltd.",
        "talks":[
            {
                "title":"Vaadin - Rich Web Applications in Java without Plug-ins or JavaScript",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/261"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/240/thumbnail.gif",
        "firstName":"Joonas"
    },
    {
        "id":329,
        "lastName":"Lensmar",
        "bio":"Ole is the creator of soapUI and co-founder of eviware, a leading Open Source Testing Tool provider. He has spoken at multiple conferences over the last years, including JavaOne and Devoxx.",
        "company":"eviware software ab",
        "talks":[
            {
                "title":"loadUI : A uniquely cool approach to Interactive Distributed Load Testing",
                "event":"Quickie (15m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/375"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/img/thumbnail.gif",
        "firstName":"Ole"
    },
    {
        "id":83,
        "lastName":"Lowagie",
        "bio":"Bruno Lowagie is the original developer and one of the current maintainers of iText. He lives in Belgium with his wife and two sons",
        "company":"1T3XT bvba",
        "talks":[
            {
                "title":"iText in Action, release of the second edition",
                "event":"University (3h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/60"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/83/thumbnail.gif",
        "firstName":"Bruno"
    },
    {
        "id":207,
        "lastName":"Machulak",
        "bio":"Maciej Machulak received his MSc in Computing Engineering from Wroclaw University of Technology in Poland in 2007. During his studies he was an Erasmus Exchange Student at Newcastle University. Maciej Machulak additionally completed the Advanced MSc degree in \"System Design for Internet Applications\" (SDIA) in 2007 at Newcastle University and his thesis was awarded Best 2007 SDIA Thesis. This degree included an industrial placement at Red Hat UK Ltd. Maciej's main task was to develop a framework for transactional Web Services. Before commencing his PhD studies Maciej was also employed as an intern at Red Hat and worked on embedded tools for transaction monitoring inside JBoss Application Server.\r\n\r\nMaciej Machulak is currently a PhD student working with Prof. Aad van Moorsel on the Trust Economics project, funded by the UK Technology Strategy Board (TSB). Maciej's project is concerned with building a novel authorization system for Web environment which allows users to flexibly adapt access control for their Web resources to their particular security requirements.\r\n\r\nMaciej's work is currently closely related to research done by the User-Managed Access Work Group (UMA WG - charter of the Kantara Initiative). The aim of the UMA WG is to develop specifications that let an individual control the authorization of data sharing and service access made between online services on the individual's behalf, and to facilitate interoperable implementations of these specifications. Maciej is a vice-chair, specification editor, implementation coordinator and use cases editor of this WG. He has recently won funding from JISC/HEFCE for the SMART (Student-Managed Access to Online Resources) project that aims to build an UMA-based authorisation solution purely in Java and to deploy this system within Newcastle University. Maciej has been employed by Newcastle University as a Research Associate to become the Project Manager for SMART.",
        "company":"Newcastle University",
        "talks":[
            {
                "title":"Introduction to UMA/j – User Managed Access framework",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/269"
            },
            {
                "title":"Introduction to UMA/j – User Managed Access framework",
                "event":"Tools in Action (30m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/270"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/207/thumbnail.gif",
        "firstName":"Maciej"
    },
    {
        "id":103,
        "lastName":"Mann",
        "bio":"Kito D. Mann is editor-in-chief of JSF Central and the author of JavaServer Faces in Action (Manning). He is a member of several Java Community Process expert groups (including JSF and Portlets), and an internationally recognized speaker. Kito is also the Principal Consultant at Virtua specializing in enterprise application architecture, training, development, mentoring, and JSF product strategy. He holds a BA in Computer Science from Johns Hopkins University.",
        "company":"Virtua",
        "talks":[
            {
                "title":"Getting Things Done for Programmers",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/109"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/103/thumbnail.gif",
        "firstName":"Kito"
    },
    {
        "id":152,
        "lastName":"McCullough",
        "bio":"Matthew McCullough is an energetic 14 year veteran of software development, open source education, and co-founder of Ambient Ideas, a Denver consultancy. Matthew is a member of the JCP, author of the upcoming Presentation Patterns & Anti-Patterns book, multi-year speaker on the No Fluff Just Stuff tour, author of the DZone Maven, Git & Google App Engine RefCards (3 of the most downloaded cards in DZone history). He channels his teaching energy through activities as President of the Denver Open Source Users Group.",
        "company":"Ambient Ideas, LLC",
        "talks":[
            {
                "title":"Encryption Boot Camp on the JVM",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/150"
            },
            {
                "title":"Using Git to just replace SVN is like using a Ferrari to haul dirt",
                "event":"Quickie (15m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/154"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/152/thumbnail.gif",
        "firstName":"Matthew"
    },
    {
        "id":58,
        "lastName":"Milicev",
        "bio":"Dr. Dragan Milicev is Associate Professor and Chairman of the Software Engineering Department at the University of Belgrade, Faculty of Electrical Engineering (www.etf.rs). He is specialized in software engineering, model-driven development, UML, object-oriented programming, software architecture and design, and information systems. He has published papers in some of the most prestigious scientific and professional journals and magazines (including IEEE Transactions on Software Engineering), contributing to the theory and practice of model-driven development and UML. He is also a member of the program committees of two most prestigious international conferences on model-based engineering (MODELS and ECMFA).\r\nHe is the author of three previous bestselling books on object-oriented programming and UML, published in Serbian. His new book, recently published by Wiley/Wrox, “Model-Driven Development with Executable UML,” has brought out some original ideas and improvements to the field of rapid model-based development of information systems, boosting the efficiency of development dramatically. It has already gained an international recognition with positive reviews and feedbacks by independent reviewers, such as: http://www.amazon.com/Model-Driven-Development-Executable-Wrox-Programmer/product-reviews/0470481633/ref=dp_top_cm_cr_acr_txt?ie=UTF8&showViewpoints=1 http://ooatool.blogspot.com/2009/12/week-50-of-2009.html\r\nWith more than 25 years of extensive industrial experience in building complex commercial software systems, he has been serving as the chief software architect, project manager, or consultant in a few dozen international projects, some of them having national scope and importance.\r\nHe is the founder of Serbian Object Laboratories d.o.o. (SOL, www.sol.rs), a software research and development company specialized in designing software development tools using model-driven approach, as well as in building custom applications and systems. He was chief software architect and project manager for most of SOL’s projects and all its products: SOLoist, a rapid application model-driven development framework for information systems; SOL UML Visual Debugger, one of the world’s first UML visual debuggers, designed for Poseidon for UML modeling tool; and SOL Java Visual Debugger, a plug-in for Eclipse that enables modeling of test object structures and visualizing Java object space using object diagrams, as well as conducting testing and debugging by visual interactions through diagrams (a tool under development).",
        "company":"SOL",
        "talks":[
            {
                "title":"SOLoist: A Java-Based Framework for Model-Driven Development of Enterprise Web Applications with Executable UML",
                "event":"Tools in Action (30m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/40"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/58/thumbnail.gif",
        "firstName":"Dragan"
    },
    {
        "id":212,
        "lastName":"Moren",
        "bio":"Lukasz Moren is a Research Assistant in Software Developer role in the School of Computing Science at Newcastle University. He is also finishing his MSc studies in Computing Science (Information Systems specialisation) at Military University of Technology in Warsaw, Poland. His final year project is concerned with building scalable Web applications using the Java enterprise architecture. During his studies he was an Erasmus Exchange Student at University of Oulu in Finland.\r\n\r\nApart from his studies Lukasz worked in industry as a JaveEE developer for a Polish insurance company from RSA Group. Before joining Newcastle University he was employed as IBM Technical Consultant. He was a successful participant of Google Summer of Code 2009 working for JBoss on design and implementation of alternative solutions for using Hibernate Search in clustered environments. His interests include cloud computing, distributed systems, web services, identity management and security and privacy.\r\n\r\nLukasz Moren is currently working with Prof. Aad van Moorsel on the SMART project funded by JISC. The project aims to develop an online data access management system based on the User-Managed Access (UMA) Web protocol, a newly proposed technology that expands OAuth V2.0. He is an active participant of UMA Work Group that standardises the UMA protocol.",
        "company":"Newcastle University",
        "talks":[
            {
                "title":"Introduction to UMA/j – User Managed Access framework",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/269"
            },
            {
                "title":"Introduction to UMA/j – User Managed Access framework",
                "event":"Tools in Action (30m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/270"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/212/thumbnail.gif",
        "firstName":"Lukasz"
    },
    {
        "id":267,
        "lastName":"Mountford",
        "bio":"Chris Mountford is a Senior Software Engineer at Atlassian, working on JIRA, the issue tracker. He has been developing Java web applications for 11 years but it all started back in 1981 on a Commodore Vic 20 as a video-game-obsessed 8 year old.",
        "company":"Atlassian",
        "talks":[
            {
                "title":"Monster Builds and How to Tame Them",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/301"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/267/thumbnail2.gif",
        "firstName":"Chris"
    },
    {
        "id":182,
        "lastName":"Moussine-Pouchkine",
        "bio":"Java EE and GlassFish developer advocate at Oracle.",
        "company":"Sun Microsystems",
        "talks":[
            {
                "title":"Java EE 6 Tutorial. Reloaded!",
                "event":"University (3h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/134"
            },
            {
                "title":"The future of the GlassFish community",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/177"
            },
            {
                "title":"From zero to Java EE 6 in 30 minutes and zero slides",
                "event":"Tools in Action (30m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/179"
            },
            {
                "title":"The JavaEE BOF",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/354"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/182/thumbnail.gif",
        "firstName":"Alexis"
    },
    {
        "id":295,
        "lastName":"Muir",
        "bio":"Pete Muir, principal software engineer at Red Hat, works as a core JBoss developer. He is the project lead for Seam and Weld (the reference implementation of JSR-299: Contexts and Dependency Injection for Java EE), and is a lead developer on Arquillian, a test harness for Java application servers. Pete also represents Red Hat on the JSF 2.0 Expert Group. Prior to Red Hat, Pete contributed to Seam while working for a UK-based staffing agency as an IT development manager. Pete blogs about Seam, Weld, and Java at http://in.relation.to/Bloggers/Pete.",
        "company":"Red Hat, Inc.",
        "talks":[
            {
                "title":"Seam 3: State of the Union",
                "event":"University (3h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/278"
            },
            {
                "title":"Seam Gathering",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/349"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/295/thumbnail.gif",
        "firstName":"Pete"
    },
    {
        "id":68,
        "lastName":"Noels",
        "bio":"Steven Noels is co-founder and CEO of Outerthought, makers of the open source Daisy CMS, the Kauri webapp framework and Lily, the first NoSQL-based content repository. Previously deeply infected by the angle brackets bug, he ventured from ancient SGML rites to hipsters' XML and then internet applications and onwards. Outerthought is a Belgian software technology provider on the crossroads of open source, REST, NoSQL and Java-based internet development. Steven is an Apache Software Foundation member, a board member of Gent BC, the platform for the Ghent innovation and technology community and has been sighted with his beloved photo camera on many occasions. Amateur/wannabe DJ, father of three and happily married keeps him busy for the remaining hours.",
        "company":"Outerthought",
        "talks":[
            {
                "title":"The NoSQL BOF",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/348"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/68/thumb.gif",
        "firstName":"Steven"
    },
    {
        "id":298,
        "lastName":"Nuxoll",
        "bio":"Joe is best known in the software technology world as a co-host of the popular podcast \"The Java Posse\".  By day, Joe is a software architect, user experience designer, race driving instructor, and avid photographer. He previously held significant positions at several top-tier Silicon Valley technology companies including Apple, Sun, Navigenics, Borland, and more than his fair share of startups. Currently Joe is enjoying life as an independent user experience consultant.",
        "company":"The Java Posse",
        "talks":[
            {
                "title":"JavaPosse Live",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/338"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/298/thumbnail.gif",
        "firstName":"Joe"
    },
    {
        "id":304,
        "lastName":"Odersky",
        "bio":"Martin Odersky is a professor in the programming research group at EPFL. Previously he has held positions at IBM Research, Yale University, University of Karlsruhe and University of South Australia, after having obtained his doctorate in 1989 from ETH Zuerich. He is associate editor of the Journal of Functional Programming and member of IFIP WG 2.8. He is also member of the expert groups JSR 14 and JSR 65 on the future evolution of the Java programming language. Martin's interests cover fundamental as well as applied aspects of programming languages. They include semantics, type systems, programming language design, and compiler construction.",
        "company":"Scala Solutions and EPFL",
        "talks":[
            {
                "title":"Scala",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/352"
            },
            {
                "title":"Future-proofing collections: from mutable to persistent to parallel",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/360"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/304/thumbnail.gif",
        "firstName":"Martin"
    },
    {
        "id":126,
        "lastName":"Ozturk",
        "bio":"Talip Ozturk is the founder of Hazelcast and Hazel Ltd. He has been working with enterprise Java since 1999. In 2003, he got fascinated by Jini and developed an implementation of JavaSpaces. In 2008, his passion for distributed programming led him to develop Hazelcast, an open source clustering and highly scalable data distribution platform for Java. Before Hazelcast, he was the director of technology at Zaman Media Group.",
        "company":"hazel bilisim ltd",
        "talks":[
            {
                "title":"Scalable Data Structures for Java",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/103"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/126/thumbnail.gif",
        "firstName":"Talip"
    },
    {
        "id":160,
        "lastName":"Portier",
        "bio":"Marc Portier is co-founder and managing partner of Outerthought, a Belgian software company at the forefront of open source and Java-based internet development. Marc has been professionally involved with Java since its early days, using it as the code and framework for all aspects of the web-application experience.\r\n\r\nOuterthought is the creator of the open source Daisy CMS, and provides support, custom development, consulting and mentoring around it. We also develop Kauri, a technical innovative web-application framework (open source) that leverages the combined advantages of the RIA (Ajax) and ROA (REST) approaches. Outerthought is currently developing Lily, a (first!) NoSQL-based content repository using Apache HBase and SOLR.",
        "company":"Outerthought BVBA",
        "talks":[
            {
                "title":"Scalable and RESTful web applications: at the crossroads of Kauri and Lily",
                "event":"Tools in Action (30m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/166"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/160/thumbnail.gif",
        "firstName":"Marc"
    },
    {
        "id":317,
        "lastName":"Potts",
        "bio":"Jasper Potts is the Developer Experience Architect for the Java Client Group at Oracle. Responsible for technical design for everything thats sis on the core platform including Controls, Tools, Samples and Blueprints. Formally a lead engineer on the JavaFX & Swing teams working on the new JavaFX UI Controls and Graphics frameworks. Also responsible for designing, developing and presenting demos during the keynotes at JavaOne and Devoxx. A JavaOne Rockstar presenter having presented many sessions on JavaFX and Swing at many conferences. Prior to Sun he founded Xerto a desktop applications company developing Imagery a Java professional photo management application.",
        "company":"Oracle",
        "talks":[
            {
                "title":"From Shabby to Chic",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/293"
            },
            {
                "title":"JavaFX",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/295"
            },
            {
                "title":"JavaFX 101",
                "event":"University (3h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/296"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/317/PAR-4_01-Jasper-Potts-100x110.png",
        "firstName":"Jasper"
    },
    {
        "id":307,
        "lastName":"Pugh",
        "bio":"William Pugh received a B.S. in Computer Science from Syracuse University and received a Ph.D. in Computer Science (with a minor in Acting) from Cornell University. He is currently a professor at the University of Maryland, College Park.\r\n\r\nWilliam Pugh is a Packard Fellow, and invented Skip Lists, a randomized data structure that is widely taught in undergraduate data structure courses.\r\n\r\nHe has also made research contributions in the fields of incremental computation, implementation of functional and object-oriented languages, the use of partial evaluation for hard real-time systems, in techniques for analyzing and transforming scientific codes for execution on supercomputers, and in a number of issues related to the Java programming language, including the development of JSR 133 - Java Memory Model and Thread Specification Revision.\r\n\r\nProf. Pugh consulted for Google in 2000 - 2003 on research that resulted in US Patent 665 8423, on detecting duplicate and near-duplicate files.\r\n\r\nProf Pugh's current research focus is on developing tools to improve software productivity, reliability and education. Current research projects include FindBugs, a static analysis tool for Java, and Marmoset, an innovative framework for improving the learning and feedback cycle for student programming projects.\r\n\r\nProfessor Pugh spent the 2008-2009 school year on sabbatical at Google, where, among other activities, he learned how to eat fire.",
        "company":"Univ. of Maryland",
        "talks":[
            {
                "title":"Defective Java: Mistakes that matter",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/362"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/307/thumbnail.gif",
        "firstName":"William"
    },
    {
        "id":297,
        "lastName":"Quinn",
        "bio":"Carl Quinn, member of the JavaPosse",
        "company":"Java Posse",
        "talks":[
            {
                "title":"JavaPosse Live",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/338"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/297/thumbnail.gif",
        "firstName":"Carl"
    },
    {
        "id":20,
        "lastName":"Raible",
        "bio":"Matt Raible has been building web applications for most of his adult life. He started tinkering with the web before Netscape 1.0 was even released. For the last 11 years, Matt has helped companies adopt open source technologies (Spring, Hibernate, Apache, Struts, Tapestry, Grails) and use them effectively. Matt has been a speaker at many conferences worldwide, including ApacheCon, JavaZone, Colorado Software Summit, No Fluff Just Stuff, and a host of others.\r\n\r\nMatt is an author (Spring Live and Pro JSP), and an active \"kick-ass technology\" evangelist on http://raibledesigns.com. He is the founder of AppFuse, a project which allows you to get started quickly with Java frameworks, as well as a committer on the Apache Roller and Apache Struts projects. \r\n\r\nFor the last few years, Matt has served as the UI Architect for high-traffic web sites such as LinkedIn and Evite. He currently serves as the Chief Architect of Web Development at Time Warner Cable.",
        "company":"Raible Designs",
        "talks":[
            {
                "title":"Comparing JVM Web Frameworks",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/97"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/20/thumbnail.gif",
        "firstName":"Matt"
    },
    {
        "id":153,
        "lastName":"Reese",
        "bio":"George Reese is the author of several books on cloud computing and enterprise technologies. His most recent book is O’Reilly’s Cloud Application Architectures. Professionally, he is the founder and CTO of enStratus, the only cloud management solution supporting enterprise security and governance for the private, public, and hybrid clouds. George has also led a number of Open Source projects, including Dasein Cloud, a cloud abstraction API for Java.\r\n\r\nGeorge holds a BA from Bates College in Maine and an MBA from the Kellogg School of Management at Northwestern University.",
        "company":"enStratus",
        "talks":[
            {
                "title":"Designing Java Systems to Operate at a Cloud Scale",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/155"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/153/thumbnail.gif",
        "firstName":"George"
    },
    {
        "id":279,
        "lastName":"Reinhold",
        "bio":"Mark Reinhold is Chief Architect of the Java Platform Group at Oracle, where he works on the Java Platform, Standard Edition, and OpenJDK. His past contributions to the platform include character-stream readers and writers, reference objects, shutdown hooks, the NIO high-performance I/O APIs, library generification, and service loaders. Mark was the lead engineer for the 1.2 and 5.0 releases and the specification lead for Java SE 6.  He is currently leading the Jigsaw and JDK 7 Projects in the OpenJDK Community.  Mark holds a Ph.D. in Computer Science from the Massachusetts Institute of Technology.",
        "company":"Oracle",
        "talks":[
            {
                "title":"Java SE: The Road Ahead",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/333"
            },
            {
                "title":"The Modular Java Platform",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/334"
            },
            {
                "title":"The state of Java SE 7",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/355"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/279/thumbnail.gif",
        "firstName":"Mark"
    },
    {
        "id":252,
        "lastName":"Rocher",
        "bio":"Graeme Rocher is a software engineer, consultant and dynamic language expert who serves as Head of Grails Development at SpringSource (http://www.springsource.com). Graeme is project lead of the open source Grails web application framework (http:// grails.org) and co-author of \"The Definitive Guide to Grails\" (Apress - http://apress.com/ book/view/1590599950).\r\nIn Graeme's current role as Head of Grails Development at SpringSource, the professional open source services company behind the Spring framework, Graeme leads the development of the Grails web framework and provides consulting, training and support to SpringSource's clients. Graeme is a frequent speaker at industry conferences on subjects related to Groovy, Grails and dynamic languages in Java.\r\nPrior to joining SpringSource Graeme co-founded G2One - the Groovy/Grails Company - who were later acquired by SpringSource.",
        "company":"SpringSource",
        "talks":[
            {
                "title":"Grails 1.3 Update",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/344"
            },
            {
                "title":"Groovy/Grails Get Together",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/350"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/252/thumbnail.gif",
        "firstName":"Graeme"
    },
    {
        "id":66,
        "lastName":"Rubensson",
        "bio":"Fredrik Rubensson is a software professional with an interest in finding the simplest possible way to achieve the highest possible quality. Fredrik is based in Stockholm and normally works in real world projects that delivers software to end users. He twitters as @froderik and shares a blog with Hardy Ferentschik at www.highlevelbits.com.",
        "company":"Independent",
        "talks":[
            {
                "title":"Continuous integration essentials",
                "event":"Quickie (15m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/173"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/66/thumbnail2.gif",
        "firstName":"Fredrik"
    },
    {
        "id":192,
        "lastName":"Runne",
        "bio":"Enno Runne\r\nDuring his studies in computer science Enno got in touch with the very new Java programming language. He became a member of Martin Odersky's programming language research team and wrote his Master's Thesis on ways of implementing Generics in Java. In his professional career Enno has worked with the different challenges of software development. He lives and works in Stockholm, Sweden.\r\n\r\nJoakim Ohlrogge\r\nCo-founder of Agical in Stockholm, Sweden a company specializing in efficient software development. He is a developer at heart who loves programming and BDD. But while technology is nice and helps it can only take you so far. Joakim believes it is the people that makes the difference and that is his real focus. A small dedicated team with skilled individuals and aligned goals can accomplish amazing things. That's why Joakim does more and more coaching around programming and software development in general.",
        "company":"-",
        "talks":[
            {
                "title":"Programming in pain",
                "event":"Quickie (15m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/266"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/img/thumbnail.gif",
        "firstName":"Enno"
    },
    {
        "id":154,
        "lastName":"Ryaboy",
        "bio":"Dmitriy Ryaboy is currently the Tech Lead for Internal Analytics at Twitter. He is a committer on the Pig project. Previously, Dmitriy worked at Lawrence Berkeley National Laboratory and at Ask.com. Dmitriy holds a bachelor's degree in Computer Science from UC Berkeley and a master's in Very Large Information Systems from Carnegie Mellon University; he interned at Cloudera. You can follow Dmitriy on Twitter, where he goes by @squarecog.",
        "company":"Twitter, Inc",
        "talks":[
            {
                "title":"Hadoop and NoSQL at Twitter",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/246"
            },
            {
                "title":"The NoSQL BOF",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/348"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/154/thumbnail2.gif",
        "firstName":"Dmitriy"
    },
    {
        "id":224,
        "lastName":"Sandoz",
        "bio":"Paul Sandoz is the co-spec lead for JSR 311: JAX-RS: The Java API for RESTful Web Services and the implementation lead for the production quality reference implementation, Jersey. When the mood of verbosity arises Paul blogs on JAX-RS/Jersey",
        "company":"Oracle",
        "talks":[
            {
                "title":"JAX-RS, Java EE 6, and the future",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/217"
            },
            {
                "title":"The JavaEE BOF",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/354"
            },
            {
                "title":"The JAX-RS/REST BOF",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/358"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/224/thumbnail.gif",
        "firstName":"Paul"
    },
    {
        "id":294,
        "lastName":"Schmidt",
        "bio":"Dr Stefan Schmidt has been a Software Engineer with SpringSource since early 2008. He is currently based in the Sydney, Australia office, where he has been a key Spring Roo developer since the project began. Stefan's work on Roo focuses on many of the most popular add-ons, including those which provide web, search and messaging features. \r\n\r\nStefan has been developing Java enterprise applications since 2003. Prior to his work at SpringSource, Stefan has been teaching various Enterprise Java subjects at the University of Technology in Sydney. He mentored hundreds of students in the design of enterprise software architectures with focus on scalability, separation of concerns and design patterns using enterprise Java technologies.",
        "company":"VMware (SpringSource division)",
        "talks":[
            {
                "title":"Extreme Productivity with Spring Roo",
                "event":"University (3h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/341"
            },
            {
                "title":"Spring BOF",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/364"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/294/thumbnail.gif",
        "firstName":"Stefan"
    },
    {
        "id":112,
        "lastName":"Schutta",
        "bio":"Nathaniel T. Schutta is a senior software engineer focussed on making usable applications. A proponent of polyglot programming, Nate has written two books on Ajax and speaks regularly at various worldwide conferences, No Fluff Just Stuff symposia, universities, and Java user groups. In addition to his day job, Nate is an adjunct professor at the University of Minnesota where he teaches students to embrace dynamic languages.",
        "company":"ntschutta.com",
        "talks":[
            {
                "title":"Ajax Library Smack down: Prototype vs. jQuery",
                "event":"University (3h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/88"
            },
            {
                "title":"HTML 5 Fact and Fiction",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/90"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/112/thumbnail.gif",
        "firstName":"Nathaniel"
    },
    {
        "id":123,
        "lastName":"Silveira",
        "bio":"Guilherme Silveira is head instructor at Caelum, a training and consulting company.  He is the creator of Restfulie, editorial chief of InfoQ Brazil, technical editor for a brazilian magazine, co-founder of the largest online portuguese speaking java user group.\r\n\r\nAfter several years fighting against tight coupling, Guilherme came across REST and finally understood how hypermedia could help us avoiding the client-must-be-updated mess.\r\n\r\nCurrently writing and recording a Rest from Scratch series showing how to create REST systems using hypermedia in its core in every language Restfulie supports so far: ruby, java and .net.",
        "company":"Caelum",
        "talks":[
            {
                "title":"Restfulie: quit pretending, use the web for real",
                "event":"Tools in Action (30m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/125"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/123/thumbnail.gif",
        "firstName":"Guilherme"
    },
    {
        "id":268,
        "lastName":"Smart",
        "bio":"John is a freelance consultant specializing in Enterprise Java, Web Development, and Open Source technologies, currently based in Wellington, New Zealand. Well known in the Java community for his many published articles, John helps organizations to optimize their Java development processes and infrastructures and provides training and mentoring in open source technologies, SDLC tools, and agile development processes. John is principal consultant at Wakaleo Consulting, a company that provides consulting, training and mentoring services in Enterprise Java and Agile Development. John is the author of Java Power Tools",
        "company":"Wakaleo Consulting",
        "talks":[
            {
                "title":"Continuous Deployment - automated build pipelines with Maven, Nexus and Hudson",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/302"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/268/thumbnail.gif",
        "firstName":"John"
    },
    {
        "id":218,
        "lastName":"Stack",
        "bio":"Michael is an HBase committer and member of the  Hadoop management committee.  He works at StumbleUpon.",
        "company":"StumbleUpon",
        "talks":[
            {
                "title":"HBase Today",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/207"
            },
            {
                "title":"Introduction to HBase",
                "event":"University (3h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/208"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/218/thumbnail.gif",
        "firstName":"Michael"
    },
    {
        "id":120,
        "lastName":"Surtani",
        "bio":"Manik Surtani is a core R&D engineer at JBoss, a division of Red Hat. He is the founder of the Infinispan project, which he currently leads, and also leads the JBoss Cache project.\r\n\r\nHis interests lie in cloud and distributed computing, autonomous systems and highly available computing. He has a background in artificial intelligence and neural networks, a field he left behind when he moved from academic circles to the commercial world. Since then, he's been working with Java-related technologies, first for a startup focusing on knowledge management and information exchange, and later for a large London-based consultancy as a tech lead focused on e-commerce applications on large Java EE and peer-to-peer technology.\r\n\r\nSurtani is a strong proponent of open source development methodologies, ethos, and collaborative processes, and has been involved in open source since his first forays into computing.",
        "company":"JBoss by Red Hat",
        "talks":[
            {
                "title":"Hacking Infinispan: the new open source data grid meets NoSQL",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/96"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/120/thumbnail.gif",
        "firstName":"Manik"
    },
    {
        "id":138,
        "lastName":"Svarovsky",
        "bio":"George Svarovsky is a Principal Technologist at IDBS with fourteen years experience of creating and maintaining enterprise applications, using lots of Java. He has dabbled in functional programming and formal methods, and thinks too much.",
        "company":"IDBS",
        "talks":[
            {
                "title":"First class curried members with jcurry",
                "event":"Quickie (15m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/157"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/img/thumbnail.gif",
        "firstName":"George"
    },
    {
        "id":219,
        "lastName":"ten Bruggencate",
        "bio":"Regina is a senior Java developer with 10 plus years experience in IT. She is also a very active member of the Duchess Community (http://www.jduchess.org).\r\nDuchess is a global network of women who work with or are interested in Java technology. Our primary focus is to support and give a voice to women in the Java industry. Duchess provides a platform for women to connect and organize themselves online and offline for real life networking. We believe that women belong in and can contribute a lot to the computer industry.",
        "company":"JDuchess",
        "talks":[
            {
                "title":"Women in IT an unconference",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/272"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/219/thumbnail.gif",
        "firstName":"Regina"
    },
    {
        "id":118,
        "lastName":"Tilkov",
        "bio":"Stefan Tilkov is a co-founder and principal consultant at innoQ, a technology consulting company with offices in Germany and Switzerland. He has been involved in the design of large-scale, distributed systems for more than a decade, using a variety of technologies and tools ranging from C++ and CORBA over J2EE/Java EE and Web Services to REST and Ruby on Rails. He has authored numerous articles and a book (\"REST und HTTP\", German), and a frequent speaker at conferences around the world.",
        "company":"innoQ Deutschland GmbH",
        "talks":[
            {
                "title":"Enterprise IT vs. WWW",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/93"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/118/thumbnail.gif",
        "firstName":"Stefan"
    },
    {
        "id":345,
        "lastName":"Topic",
        "bio":"Dalibor Topic lives in Hamburg, Germany, and works as Java F/OSS Ambassador for Oracle. He joined the OpenJDK project in order to help make it a successful open source project, and stayed for anchoring Java in Linux distributions, and as an all around Java F/OSS community guy. He joined the Java strategy\r\nteam at Oracle to help provide community feedback into the long-term strategy planning.",
        "company":"Oracle",
        "talks":[
            {
                "title":"OpenJDK",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/381"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/345/thumbnail.gif",
        "firstName":"Dalibor"
    },
    {
        "id":320,
        "lastName":"Van Coppenolle",
        "bio":"Jan Van Coppenolle is a certified Flex developer and lead Flash platform innovation architect at Xplore. He's got roots in integrated product development and ended up in interface design, multimedia and online echnologies through a series of events since 1996.\r\n\r\nCurrently he's involved in Flex/Flash/AIR development as a project manager, team coach, instructor, researcher and hardcore coding champion.",
        "company":"Xplore Group",
        "talks":[
            {
                "title":"Flash Platform Mobile Development",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/380"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/320/thumbnail.gif",
        "firstName":"Jan"
    },
    {
        "id":185,
        "lastName":"Van der Auwera",
        "bio":"Joachim Van der Auwera is part of the three-headed dragon leading the development/architecture of the Geomajas GIS web mapping project.\r\nHis achievements in the project include the security architecture, plug-in mechanism, API contract, documentation system etc.\r\nHe has more than 10 years Java experience, mostly for enterprise projects.",
        "company":"Geosparc nv",
        "talks":[
            {
                "title":"Geomajas web mapping users meeting",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/233"
            },
            {
                "title":"Introduction to the Geomajas web mapping framework",
                "event":"Quickie (15m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/237"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/185/thumbnail2.gif",
        "firstName":"Joachim"
    },
    {
        "id":273,
        "lastName":"Venners",
        "bio":"Bill Venners is president of Artima, Inc., publisher of Artima Developer (www.artima.com). He is author of the book, Inside the Java Virtual Machine, a programmer-oriented survey of the Java platform's architecture and internals. His popular columns in JavaWorld magazine covered Java internals, object-oriented design, and Jini. Active in the Jini Community since its inception, Bill led the Jini Community's ServiceUI project, whose ServiceUI API became the de facto standard way to associate user interfaces to Jini services.  Bill is also the lead developer and designer of ScalaTest, an open source testing tool for Scala and Java developers, and coauthor with Martin Odersky and Lex Spoon of the book, Programming in Scala.",
        "company":"Artima, Inc.",
        "talks":[
            {
                "title":"What's New in Scala 2.8?",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/318"
            },
            {
                "title":"Scala",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/352"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/273/thumbnail.gif",
        "firstName":"Bill"
    },
    {
        "id":110,
        "lastName":"Vos",
        "bio":"Johan Vos started to work with Java in 1995. He worked on the Java Linux port with the Blackdown team. He has been doing Java consulting and development for a number of customers in completely different areas. Over the years, he has been active in a number of Java-based community projects, e.g. OSGi, the Glassfish project and JFXtras.org.\r\nWith LodgON, the company he co-founded, he is mainly working on Java solutions for social networking software. \r\nSince he can't make a choice between embedded development and enterprise development, his main focus is on end-to-end Java, combining the strengths of back-end systems and embedded devices. His favourite technologies are currently Java EE / Glassfish at the backend and JavaFX at the frond-end.",
        "company":"LodgON",
        "talks":[
            {
                "title":"Using RedFX to connect JavaFX clients and Java Enterprise systems",
                "event":"Tools in Action (30m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/317"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/110/thumbnail.gif",
        "firstName":"Johan"
    },
    {
        "id":272,
        "lastName":"Wall",
        "bio":"JavaPosse member",
        "company":"The Java Posse",
        "talks":[
            {
                "title":"What's New in Scala 2.8?",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/318"
            },
            {
                "title":"JavaPosse Live",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/338"
            },
            {
                "title":"Scala",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/352"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/272/thumbnail.gif",
        "firstName":"Dick"
    },
    {
        "id":216,
        "lastName":"Ward",
        "bio":"Tim Ward is a design and development lead for IBM’s OSGi Applications Feature Pack for WebSphere Application Server. He is an active participant in the OSGi Enterprise Expert Group (EEG), which creates specifications describing the use of enterprise technologies in an OSGi framework. As an EEG member he co-authored the RFC and draft specification for the use of JPA in an OSGi environment and is currently leading a number of RFCs. He is also a committer and initial contributor in the Apache Aries project, which provides an application container based on implementations of the application-focused specifications defined by the EEG. Aside from his extensive work with OSGi technologies over the last four years Tim is a recognised JPA advocate and one of IBM's key Spring Framework experts with development experience across four versions of WebSphere Application Server.",
        "company":"IBM",
        "talks":[
            {
                "title":"A crash course in OSGi application development",
                "event":"Quickie (15m)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/206"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/img/thumbnail.gif",
        "firstName":"Timothy"
    },
    {
        "id":46,
        "lastName":"Wessendorf",
        "bio":"Apache guy and principal software engineer at Oracle. Matthias is a member of Oracle's ADF Faces group, where his current focus is the integration of the server-side-push technologies.",
        "company":"Oracle",
        "talks":[
            {
                "title":"WebSockets meet JavaServer Faces",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/32"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/46/thumbnail.gif",
        "firstName":"Matthias"
    },
    {
        "id":287,
        "lastName":"White",
        "bio":"Tom White has been an Apache Hadoop committer since February 2007, and is a member of the Apache Software Foundation. He is the author of \"Hadoop: The Definitive Guide\" published by O'Reilly. Previously he worked as an independent consultant specializing in Hadoop, and before that was co-founder and Lead Developer at Kizoom, a UK mobile application startup.\r\n\r\nTom has a Bachelor's degree in Mathematics from the University of Cambridge, and a Master's degree in History and Philosophy of Science from the Universities of Leeds, UK, and Florence, Italy.",
        "company":"Cloudera",
        "talks":[
            {
                "title":"The State of Hadoop",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/339"
            },
            {
                "title":"Hadoop Fundamentals: HDFS, MapReduce, Pig, and Hive",
                "event":"University (3h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/340"
            },
            {
                "title":"The NoSQL BOF",
                "event":"Bof (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/348"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/287/thumbnail.gif",
        "firstName":"Tom"
    },
    {
        "id":230,
        "lastName":"Willis",
        "bio":"John M. Willis is currently the VP of Services at Opscode, Inc.  John has worked in the IT management industry for 30 years. He began his professional career at Exxon as an IT infrastructure analyst.  He is the founder of four successful startups over the past 20 years Willis is known internationally for his IT Management and Cloud blog. He also has two podcast series on clouds called ‚”Cloud Cafe‚ and Droplets”.  Willis is also the co-host of Redmonk’s IT Management Guys‚ podcast series.",
        "company":"Opscode",
        "talks":[
            {
                "title":"Does dev/ops matter for me?",
                "event":"Conference (1h)",
                "presentationUri":"http://cfp.devoxx.com/rest/v1/events/presentations/168"
            }
        ],
        "imageURI":"http://cfp.devoxx.com/static/images/230/thumbnail.gif",
        "firstName":"John"
    }
]