[{"id":244,"lastName":"Allen","bio":"Dan is a Principal Software Engineer at JBoss, by Red Hat. He serves as the JBoss Community liaison, founded the JBoss Testing Initiative and is a member of the Seam 3, Weld, Arquillian and ShrinkWrap projects.\r\n\r\nDan's known for his hard work and passion for Open Source technologies. His technical expertise spans the Java EE platform, testing frameworks, build tools and web development. He authored of Seam in Action (Manning 2008), served on the JSR-314 Expert Group (JSF 2.0), writes for IBM developerWorks and NFJS magazine and is an internationally recognized speaker. He's appeared at major industry conferences, including JavaOne, Devoxx, NFJS, JAX and Jazoon and has received recognition as a JavaOne Rock Star, a JBossWorld Top Presenter and a JAX Hall of Fame speaker.\r\n\r\nYou can keep up with Dan's activity by following him on Twitter (@mojavelinux) or reading his blog (http://community.jboss.org/people/dan.j.allen/blog).","company":"Red Hat, Inc.","talks":[{"title":"Seam 3: State of the Union","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/278"},{"title":"Seam Gathering","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/349"},{"title":"The roots of Java EE 6: JSR-299 (CDI) and Weld extensions","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/379"},{"title":"Forge new Ground in Rapid Enterprise Java Development","event":"Tools in Action","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/459"},{"title":"7 Reasons to Love AS 7","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/664"},{"title":"Seam Gathering","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/714"},{"title":"Java EE Gathering","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/922"}],"imageURI":"https://cfp.devoxx.com/static/images/244/thumbnail.gif","firstName":"Dan"},{"id":290,"lastName":"Almaer","bio":"Dion Almaer is the director of developer relations at Palm where he has the pleasure of working with Ben Galbraith. The pair co-founded Ajaxian.com together, and they are now focused on delivering a fantastic developer experience on the mobile Web.\r\n\r\nDion has been a technologist and a developer writing web applications since it took over from Gopher. He has been fortunate enough to speak around the world, has published many articles, a book, and of course covers life, the universe, and everything on his blog at almaer.com/blog.\r\n\r\nHe has been called a human aggregator, and you can see that in full force if you follow him on Twitter @dalmaer.","company":"Wallmart","talks":[{"title":"The State of the Web","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/342"},{"title":"Web vs. Apps","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/866"}],"imageURI":"https://cfp.devoxx.com/static/images/290/thumbnail.gif","firstName":"Dion"},{"id":292,"lastName":"Almeida","bio":"Working for Caelum since 2008 as consultant, developer and instructor. Already talked on important events in Brazil, and participate on several open source projects, such as VRaptor and Restfulie. Also writes technical articles for the Brazilian magazine \"Mundo Java\". Nowadays also develops in Ruby and Rails. Loves to learn new stuffs everyday and share these new knowledges with others.","company":"Caelum","talks":[{"title":"Restfulie: quit pretending, use the web for real","event":"Tools in Action","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/125"},{"title":"Hibernate/JPA type safe query in Scala: an implicit help from the language","event":"Tools in Action","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/648"}],"imageURI":"https://cfp.devoxx.com/static/images/292/adrianoalmeida.jpg","firstName":"Adriano"},{"id":5,"lastName":"Almiray","bio":"Andres is a Java/Groovy developer and a Java Champion with more than 12 years of experience in software design and development. He has been involved in web and desktop application development since the early days of Java. He is a true believer in open source and has participated on popular projects like Groovy, Griffon, and DbUnit, as well as starting his own projects (Json-lib, EZMorph, GraphicsBuilder, JideBuilder). Founding member of the Griffon framework. Andres maintains a blog at http://jroller.com/aalmiray","company":"Canoo","talks":[{"title":"A desktop app in minutes? Griffon to the rescue","event":"Quickie","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/6"},{"title":"The Groovy Ecosystem","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/404"},{"title":"Fyling with Griffon","event":"Quickie","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/407"}],"imageURI":"https://cfp.devoxx.com/static/images/5/","firstName":"Andres"},{"id":999,"lastName":"Andreadis","bio":"Dimitris is the Manager of the JBoss Application Server group in the JBoss Division of Red Hat. He has been a JBoss addict and contributor from the early JBoss days and joined JBoss in 2004. He became the Lead of the JBoss AS project for three years since 2006. Previously he spent seven years at Intracom and Motorola in the areas of NMS/OSS, designing reusable frameworks and distributed systems. Dimitris studied computer science at the Technological Educational Institute of Athens and received an M.Sc. by research from University College Dublin, Ireland.","company":"JBoss, by Red Hat","talks":[{"title":"JBoss Application Server 7 - Community BOF","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/678"}],"imageURI":"https://cfp.devoxx.com/static/images/999/dimitrisa.png","firstName":"Dimitris"},{"id":9,"lastName":"Aniszczyk","bio":"Chris Aniszczyk is the Open Source Manager at Twitter and tends to be all over the eclipse.org community by committing on various projects and helping new eclipse.org projects off the ground. He is the co-author of The Eclipse Rich Client Platform book and has been recognized by the Eclipse Community Awards as Top Ambassador and Top Committer in the past. He sits on the Eclipse Architecture Council, Eclipse Planning Council and has the honor to represent the committers on the Eclipse Foundation's Board of Directors. Chris's passions are modularity, running and open source.","company":"Red Hat","talks":[{"title":"Code Review with Git and Gerrit","event":"Tools in Action","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/696"}],"imageURI":"https://cfp.devoxx.com/static/images/9/thumbnail.gif","firstName":"Chris"},{"id":877,"lastName":"Asari","bio":"Hiro Asari is a JRuby Support Engineer at Engine Yard, a PaaS company specializing in Ruby on Rails hosting. He is an active committer to the JRuby project.","company":"Engine Yard","talks":[{"title":"JRuby: Enhancing Java Developers' Lives","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/711"}],"imageURI":"https://cfp.devoxx.com/static/images/877/thumbnail.gif","firstName":"Hirotsugu"},{"id":264,"lastName":"Bair","bio":"Richard Bair is the architect for the client Java platform at Oracle. He was an influential lead in the development of JavaFX UI controls and associated APIs. Prior to that he was the lead of the SwingLabs project, which was an open source community supported by Sun with a focus on enhancing and extending Swing. Before working at Sun, Blair was an application developer with a focus on data-oriented rich client applications backed by databases. He has a passion for graphics, performance, and developer productivity.","company":"Oracle","talks":[{"title":"From Shabby to Chic","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/293"},{"title":"JavaFX","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/295"},{"title":"JavaFX 101","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/296"},{"title":"Physically Attractive","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/398"},{"title":"Java Rich Clients with JavaFX 2.0","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/741"},{"title":"JavaFX Under The Hood","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/745"},{"title":"Practical Experience Building JavaFX Rich Clients","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/748"},{"title":"JavaFX Open Mic","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/762"},{"title":"JavaFX 2.0 Hands On","event":"Hands-on Labs","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/764"}],"imageURI":"https://cfp.devoxx.com/static/images/264/thumbnail.gif","firstName":"Richard"},{"id":847,"lastName":"Bakker","bio":"Paul is senior software engineer at Luminis Technologies where he works on the Amdatu platform, an open source, service-oriented application platform for web applications. \r\n\r\nHe has a background as trainer where he teached various Java related subjects. Paul is also a regular speaker on conferences and author for the Dutch Java Magazine.","company":"Info Support","talks":[{"title":"Building Next-generation Enterprise Applications in Java a.k.a. Duke’s Duct Tape Adventures","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/480"}],"imageURI":"https://cfp.devoxx.com/static/images/847/thumbnail.gif","firstName":"Paul"},{"id":62,"lastName":"Barker","bio":"Michael Barker is currently a lead developer at London Multi-Asset eXchange (LMAX) where he spends most of his time scratching his head while thinking about simpler and faster solutions. \r\n\r\nIntermingled with travelling to various countries around the world, Michael's 10+ years of experience has been spent battling unnecessary complexity across a variety of industries (finance, telecoms, government) and in whatever technology that happens to have been hurled in his direction (Java/JavaEE, C++, .NET).  Michael is also a sporadic Open Source contributor having dropped patches into a number of OSS projects including PostgreSQL, JBoss, GNU Classpath and most recently Mono.","company":"LMAX","talks":[{"title":"The Disruptor, High Performance Inter-Thread Messaging","event":"Tools in Action","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/705"}],"imageURI":"https://cfp.devoxx.com/static/images/62/thumbnail.gif","firstName":"Michael"},{"id":1080,"lastName":"Barry","bio":"Sonya Barry has been with Java.net since she was a graduate student intern at Sun Microsystems in 2006. She took over as Community Manager in February 2009 and has managed the site and Java community through the transition from Sun to Oracle.","company":"Oracle","talks":[{"title":"Lessons from the Java.net Migration: Managing an Open Source Community through Major Change","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/908"}],"imageURI":"https://cfp.devoxx.com/static/images/1080/thumbnail.gif","firstName":"Sonya"},{"id":241,"lastName":"Bateman","bio":"Alan Bateman is an engineer in the JDK team in Oracle. For JDK 7 he has mostly been focused on the core libraries/APIs and lead JSR-203 that defined the new file system API and asynchronous I/O APIs that are new in JDK 7.","company":"Oracle Corporation","talks":[{"title":"The File System API in JDK 7","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/634"}],"imageURI":"https://cfp.devoxx.com/static/images/241/thumbnail.gif","firstName":"Alan"},{"id":71,"lastName":"Baxter III","bio":"Lincoln Baxter, III is a Senior Software Engineer at JBoss, by Red Hat. He is the project-lead of Seam Forge – a standards based rapid application development tool, the founder of OCPSoft.com, and creator of PrettyFaces – URL-Rewriting and SEO extensions for Servlet, Java EE, and JSF. He is also the creator of PrettyTime – Social-style date & time formatting for Java, a member of the JBoss Seam Team, and a member of the JSF2 Expert Group.\r\n\r\nWhen he is not speaking at conferences, swimming, running, or playing Ultimate Frisbee, Lincoln is focused on improving the openness of Java, the Java Community Process(JCP), and bringing the J2EE platform to small businesses and freelancers. You can stay current on his latest open-source developments by following him on Twitter (@lincolnthree), or subscribing to his blog at http://ocpsoft.com/.","company":"Red Hat, Inc.","talks":[{"title":"Beautiful Java EE: URL-rewriting for the next generation web-user","event":"Tools in Action","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/59"},{"title":"Seam Gathering","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/349"},{"title":"Forge new Ground in Rapid Enterprise Java Development","event":"Tools in Action","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/459"}],"imageURI":"https://cfp.devoxx.com/static/images/71/thumbnail.gif","firstName":"Lincoln"},{"id":117,"lastName":"Bernard","bio":"Emmanuel Bernard is data platform architect at JBoss by Red Hat and member of the Hibernate team.\r\nAfter graduating from Supelec (French \"Grande Ecole\"), Emmanuel has spent a few years in the retail industry as developer and architect where he started to be involved in the ORM space. He joined the Hibernate team in 2003.\r\nEmmanuel has lead the JPA implementation of Hibernate. He has founded and leads Hibernate Search, Hibernate Validator and the newcommer Hibernate OGM.\r\nEmmanuel is a member of the JPA 2.0 expert group and the spec lead of Bean Validation. He is a regular speaker at various conferences and JUGs, including JavaOne, JBoss World and Devoxx and the co-author of Hibernate Search in Action published by Manning. He is also founder and co-host of two podcasts: JBoss Community Asylum and Les Cast Codeurs Podcast.\r\nYou can follow him on twitter at @emmanuelbernard","company":"JBoss by Red Hat","talks":[{"title":"What's new in Hibernate: a JPA 2 perspective","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/92"},{"title":"JPA on NoSQL: an approach with Hibernate OGM","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/542"},{"title":"CDI, what comes next?","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/622"},{"title":"Java EE Gathering","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/922"}],"imageURI":"https://cfp.devoxx.com/static/images/117/thumbnail.gif","firstName":"Emmanuel"},{"id":807,"lastName":"Bonér","bio":"Jonas Bonér is a entrepreneur, programmer, teacher, mentor, speaker, author and Java Champion who spends most of his time hacking on open source and lecturing and speaking at developer conferences world-wide. He has worked at Terracotta, the JRockit JVM at BEA and is an active contributor to the Open Source community; most notably created the Akka Project, AspectWerkz Aspect-Oriented Programming (AOP) framework, committer to the Terracotta JVM clustering technology and been part of the Eclipse AspectJ team. He blogs occasionally at: http://jonasboner.com","company":"Typesafe","talks":[{"title":"Above the Clouds: Introducing Akka","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/438"}],"imageURI":"https://cfp.devoxx.com/static/images/807/","firstName":"Jonas"},{"id":1085,"lastName":"Bray","bio":"Tim is a software developer and entrepreneur, currently working as Developer Advocate for Android at Google. He lives in Vancouver, Canada, and travels heavily. Tim co-founded Open Text Corporation and Antarctica Systems. Bray was Director of Web Technologies at Sun Microsystems from early 2004 to early 2010.","company":"Google","talks":[{"title":"Fireside Chat","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/918"}],"imageURI":"https://cfp.devoxx.com/static/images/1085/thumbnail.gif","firstName":"Tim"},{"id":861,"lastName":"Breslav","bio":"Andrey is the lead language designer for Project Kotlin, he joined the JetBrains team in 2010.","company":"JetBrains","talks":[{"title":"The Kotlin Programming Language","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/640"}],"imageURI":"https://cfp.devoxx.com/static/images/861/thumbnail.gif","firstName":"Andrey"},{"id":1082,"lastName":"Butcher","bio":"Nick is an Android Developer Advocate in Google's London office. He has a passion for mobile technologies and learned his trade in the gnarly world of Windows Mobile development. He is particularly interested in producing sublime mobile user interfaces & works with developers to make high quality Android apps. In his spare time he is an aspiring runner & triathlete.","company":"Google","talks":[{"title":"Whatʼs new and important in Android","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/910"}],"imageURI":"https://cfp.devoxx.com/static/images/1082/thumbnail.gif","firstName":"Nick"},{"id":1093,"lastName":"Chandler","bio":"David Chandler works with the Google Web Toolkit Team in Atlanta. An electrical engineer by training, Chandler got hooked on developing database Web applications in the days of NCSA Mosaic and has since written Web applications professionally in a variety of languages, including C, perl, ksh, ColdFusion, Java, JSF, and GWT. Prior to joining Google, Chandler worked on Internet banking applications with Intuit and launched a non-profit startup built with GWT and AppEngine. Chandler holds a patent on a method of organizing hierarchical data in a relational database and blogs about Java Web development at turbomanage.wordpress.com.","company":"Google","talks":[{"title":"These Aren't the Sites You're Looking For: Modern HTML5 Web Apps","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/927"}],"imageURI":"https://cfp.devoxx.com/static/images/1093/thumbnail.gif","firstName":"David"},{"id":870,"lastName":"Chanezon","bio":"Patrick Chanezon joined Google in 2005, he manages the Cloud and Apps Developer Relations team in San Francisco. Previously he has been a Developer Advocate, building and growing developer ecosystems for HTML5, OpenSocial, Google Checkout and the AdWords API, and worked as a software architect at Sun Microsystems, AOL, Netscape and Accenture.\r\nMore on his blog at http://wordpress.chanezon.com/ or his tweeter stream at http://twitter.com/chanezon","company":"Google","talks":[{"title":"Cloud is such stuff as dreams are made on","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/899"}],"imageURI":"https://cfp.devoxx.com/static/images/870/PatrickChanezon-2010-profile-square-100.jpg","firstName":"Patrick"},{"id":1021,"lastName":"Chechel","bio":"Anton Chechel is a software engineer at Sun Microsystems/Oracle. He is working on NetBeans Mobility and NetBeans JavaFX support for last 6 years.","company":"Oracle","talks":[{"title":"Jackpot 3.0 - Large scale custom refactorings made easy","event":"Tools in Action","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/767"}],"imageURI":"https://cfp.devoxx.com/img/thumbnail.gif","firstName":"Anton"},{"id":98,"lastName":"Chin","bio":"Stephen Chin is a technical expert in RIA technologies, and Chief Agile Methodologist at GXS where he led a large-scale Lean/Agile rollout and pioneered the practice of Agile Portfolio Kanban Planning. He is lead author of Pro Android Flash and coauthored the Apress Pro JavaFX Platform title, which is the current leading technical reference for JavaFX. In addition, Stephen supports the local developer community by running the Flash on Devices and Silicon Valley JavaFX User Groups. Finally, he is a Java Champion and an internationally recognized speaker featured at Devoxx, Jazoon, and JavaOne, where he received a Rock Star Award. Stephen can be followed on twitter @steveonjava and reached via his blog: http://steveonjava.com/","company":"GXS","talks":[{"title":"JavaFX Your Way: Building JavaFX Applications with Alternative Languages","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/376"},{"title":"Visage Android Workshop","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/377"},{"title":"Moving to the Client - JavaFX and HTML5","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/836"},{"title":"JavaFX 2.0 - A Java Developer's Guide","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/837"}],"imageURI":"https://cfp.devoxx.com/static/images/98/steve-champion-100x110.png","firstName":"Stephen"},{"id":326,"lastName":"Cimadamore","bio":"Main focus on type-system area of javac/javafxc compilers, improving generics/wildcards support (actively improving JLS coverage in that area), improving javac error messages and enhancing interoperability between JavaFX and Java.","company":"oracle","talks":[{"title":"Project Coin: Small Language Changes in JDK 7","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/337"},{"title":"Project Coin in JDK 7 and 8","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/869"}],"imageURI":"https://cfp.devoxx.com/static/images/326/thumbnail.gif","firstName":"Maurizio"},{"id":335,"lastName":"Colebourne","bio":"Stephen Colebourne is a Java Champion and JavaOne Rock Star speaker.\r\n\r\nHe  has been working with Java since version 1.0 and contributing to open source software since 2000. He has made major contributions to Apache Commons and created the Joda open source projects including Joda-Time. He blogs on Java topics and is a frequent conference speaker. He is currently co-spec lead on JSR-310 and a contributor to discussions on language change such as Project Coin and Lambda.","company":"OpenGamma","talks":[{"title":"The Next Big JVM Language","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/388"},{"title":"The Future of Java Discussion Panel","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/397"},{"title":"Is Fantom light years ahead of Scala?","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/926"}],"imageURI":"https://cfp.devoxx.com/static/images/335/thumbnail2.gif","firstName":"Stephen"},{"id":282,"lastName":"Darcy","bio":"At Oracle Joe is currently the lead engineer of Project Coin, the effort to select and implement a set of small Java language changes for JDK 7. He also serves as a member of the JDK 7 release team. Concurrently, Joe continues to be the release manager, lead engineer, and quality lead for OpenJDK 6, an open source implementation of the Java SE 6 platform.  A longtime member of the JDK engineering group, Joe was previously specification lead for JSR 269, the Pluggable Annotation Processing API, which delivered a standardized annotation processing API and mirror-based language model into JDK 6 to supersede the earlier apt tool from JDK 5. Joe assisted in implementing the JDK 5 language changes with work spanning core reflection, javac hacking, and general library support.\r\n\r\nJoe holds a master's degree in computer science from UC Berkeley and a master's degree in applied math from Stanford University.","company":"Oracle","talks":[{"title":"Project Coin: Small Language Changes in JDK 7","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/337"},{"title":"The state of Java SE 7","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/355"},{"title":"Project Coin in JDK 7 and 8","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/869"}],"imageURI":"https://cfp.devoxx.com/static/images/282/thumbnail.gif","firstName":"Joe"},{"id":1071,"lastName":"Deakin","bio":"Nigel is a principal member of technical staff at Oracle. He is a developer on Open Message Queue, part of GlassFish server, the reference implementation for Java EE. He is also the specification lead for JSR 343 which is defining JMS 2.0, the next version of the Java Message Service specification.","company":"Oracle","talks":[{"title":"What's Coming in Java Message Service 2.0","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/890"},{"title":"Java EE Gathering","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/922"}],"imageURI":"https://cfp.devoxx.com/static/images/1071/thumbnail2.gif","firstName":"Nigel"},{"id":50,"lastName":"Dochez","bio":"Jerome Dochez is an experienced speaker with more than 11 years of speaking presence at JavaOne, 3 years at Jazoon et various Sun Tech Days events.\r\n\r\nHe is the GlassFish architect, who successfully lead the modularization effort of the monolithic GlassFish V2 implementation into more than 200 individually reusable OSGi bundles. \r\n\r\nDespite being an architect, Jerome still spends most of his days writing code.","company":"Oracle Corporation","talks":[{"title":"The Future Roadmap of Java EE","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/326"},{"title":"The JavaEE BOF","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/354"},{"title":"HK2: Oracle WebLogic Server, Oracle GlassFish Server, and Beyond","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/382"},{"title":"Pragmatic Cloud and PaaS with Java EE 7 (and GlassFish)","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/873"}],"imageURI":"https://cfp.devoxx.com/static/images/50/thumbnail.gif","firstName":"Jerome"},{"id":1079,"lastName":"Ducrohet","bio":"Xavier is the tech-lead for the Android SDK and Developer Tools. He joined Google in 2007 and holds a MS in Computer Science from EFREI, France.","company":"Google Inc.","talks":[{"title":"Android Development Tools","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/897"},{"title":"Android Tools in Action","event":"Tools in Action","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/898"},{"title":"Android Tools BOF","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/906"}],"imageURI":"https://cfp.devoxx.com/static/images/1079/thumbnail.gif","firstName":"Xavier"},{"id":1084,"lastName":"Dutton","bio":"Sam Dutton is a Developer Advocate for Chrome at Google in London. Sam has designed and coded numerous websites, but has also built applications with C++/Qt and has some experience of Symbian and Android. He is excited by the increasingly high base level of capability in browsers and (mobile) hardware. He previously worked for the BBC and ITN, is a governor at Ravenstone School in London, and cares passionately about the ICT school curriculum.","company":"Google","talks":[{"title":"Working Off the Grid: HTML5 Offline","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/913"}],"imageURI":"https://cfp.devoxx.com/static/images/1084/thumbnail.gif","firstName":"Sam"},{"id":845,"lastName":"Ertman","bio":"Bert is a Fellow at Luminis in the Netherlands. Next to his customer assignments he is responsible for stimulating innovation, knowledge sharing, coaching, technology choices and presales activities. Besides his day job he is a Java User Group leader for NLJUG, the Dutch Java User Group (3500+ members). A frequent speaker on Java (SE/EE) and Software Architecture related topics as well as an author and member of the editorial advisory board for Dutch software development magazine: Java Magazine. In 2008, Bert was honored by being awarded the coveted title of Java Champion by an international panel of Java leaders and luminaries.","company":"Luminis","talks":[{"title":"Building Next-generation Enterprise Applications in Java a.k.a. Duke’s Duct Tape Adventures","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/480"}],"imageURI":"https://cfp.devoxx.com/static/images/845/thumbnail.gif","firstName":"Bert"},{"id":930,"lastName":"Evans","bio":"Ben Evans has lived in \"Interesting Times\" in technology - he was the lead performance testing engineer for the Google IPO, worked on the initial UK trials of 3G networks with BT, built award-winning websites for some of Hollywood's biggest hits of the 90s, rearchitected and reimagined technology helping some of the most vulnerable people in the UK and has worked on everything from some of the UKs very first ecommerce sites, through to multi-billion dollar currency trading systems. He helps to run the London Java Community, and represents the JUG on the Java SE/EE Executive Committee. His first book \"The Well-Grounded Java Developer\" (with Martijn Verburg) has just been published by Manning.","company":"Erzulie Technologies","talks":[{"title":"Less annoying Java standards","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/571"},{"title":"The Well-Grounded Java Developer","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/572"}],"imageURI":"https://cfp.devoxx.com/static/images/930/thumbnail.gif","firstName":"Ben"},{"id":1086,"lastName":"Forta","bio":"Ben Forta is Adobe Inc.'s Director of Platform Evangelism, and has over two decades of experience in the computer industry in product development, support, training, and marketing. Ben is the author of the best-selling ColdFusion Web Application Construction Kit series, as well as multiple books on SQL, Regular Expressions, Java Server Pages, WAP, Windows development, and more. Over 1/2 million Ben Forta books have been printed in English, and titles have been translated into fifteen languages. Ben co-authored the official ColdFusion training material as well as the certification tests and study guides for those tests, writes regular columns on Internet application development, and now spends a considerable amount of time lecturing and speaking on application development worldwide.","company":"Adobe","talks":[{"title":"Fireside Chat","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/918"}],"imageURI":"https://cfp.devoxx.com/static/images/1086/thumbnail.gif","firstName":"Ben"},{"id":291,"lastName":"Galbraith","bio":"Ben Galbraith is a frequent technical speaker, occasional consultant, and author of several Java-related books. He is a co-founder of Ajaxian.com, an experienced CTO and Java Architect, and is presently a consultant specializing in Java Swing and Ajax development. Ben wrote his first computer program when he was six years old, started his first business at ten, and entered the IT workforce just after turning twelve. For the past few years, he’s been professionally coding in Java. Ben has delivered hundreds of technical presentations world-wide at venues including JavaOne, The Ajax Experience, JavaPolis, and the No Fluff Just Stuff Java Symposium series; he was the top-rated speaker at JavaOne 2006.","company":"na","talks":[{"title":"The State of the Web","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/342"},{"title":"Web vs. Apps","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/866"}],"imageURI":"https://cfp.devoxx.com/static/images/291/thumbnail.gif","firstName":"Ben"},{"id":1032,"lastName":"Gaudin","bio":"Olivier Gaudin is co-founder and CEO at SonarSource, the company that develops and promotes the \r\nopen source platform Sonar to manage source code quality.\r\n\r\nOlivier started his carea in London, working on trading systems in the banking industry. He then managed IT for a startup, ran big projects such as off-shoring, CMMi and ran support and  development departments. Olivier has developed a strong sensibility to robustness of processes and  quality of delivery.\r\nIn 2007, Olivier starts contributing to Sonar and decides with Simon Brandhof and Freddy Mallet to \r\nsetup SonarSource, the company that develops and promotes Sonar while growing some business around the platform.","company":"SonarSource","talks":[{"title":"Continuous Inspection with Sonar","event":"Tools in Action","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/813"}],"imageURI":"https://cfp.devoxx.com/static/images/1032/","firstName":"Olivier"},{"id":231,"lastName":"Geary","bio":"David is the founder of Clarity Training, where he teaches software developers to implement web applications using HTML5, JavaServer Faces, and Google Web Toolkit. David is the co-founder of the HTML5 Denver Users Group, and the author of Core HTML5 Canvas, published by Pearson publishing.\r\n\r\nA prominent author, speaker, and consultant, David is the author of 6 Java books, four of which are best-sellers in their respective categories, including one of the best-selling Java book series of all time, Graphic Java. David is currently writing Core HTML5 for Prentice-Hall.\r\n\r\nDavid has worked on several open-source projects, and was the second committer for the venerable Struts web application framework. David served on Sun expert groups, helping to define technologies such as the JSP tag library, and JavaServer Faces. David is also a prolific speaker who has spoken at hundreds of conferences, and is a three-time JavaOne Rock Star.","company":"Clarity Training, Inc.","talks":[{"title":"Google Web Toolkit, Take 2: Implementing Awesome Rich Internet Applications","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/244"},{"title":"HTML5 Game Development: The most fun you can have in a browser","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/497"}],"imageURI":"https://cfp.devoxx.com/static/images/231/thumbnail.gif","firstName":"David"},{"id":237,"lastName":"Gielen","bio":"René Gielen is an independent senior software craftsman, consultant, trainer, lecturer and author, focused on the Java platform ecosystem, Web 2.0 and RIA technologies, agile development methodologies and enterprise grade database design and management solutions. In the last 10 years, he has helped clients ranging from startups to large multinational companies realizing software projects of any scale, in various roles like software architect, senior developer, project lead, trainer, mentor or technology enabler. He is also a guest author in Java champion Michael Hüttermann’s upcoming book “Agile Application Lifecycle Management” published by Manning.\r\nWhenever possible, René tries to invest time in his open source activities. He is the project management committee (PMC) chair of the Apache Struts project and Vice President of The Apache Software Foundation. Besides other open source activities, he is and was active in the development and design of the Apache Struts 2 framework, as well as in the XWork and WebWork projects at the OpenSymphony Group.","company":"IT-Neering.net","talks":[{"title":"Meet Agile ALM: Agile Application Lifecycle Management","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/487"}],"imageURI":"https://cfp.devoxx.com/static/images/237/Profil100.gif","firstName":"René"},{"id":54,"lastName":"Gierke","bio":"Oliver Gierke is project lead of the Spring Data JPA module and involved into other Spring Data modules (e.g. MongoDB) as well. He has been into developing enterprise applications and open source projects for over 6 years now. His working focus is centered around software architecture, Spring and persistence technologies. He is regularly speaking at German and international conferences as well as author of articles.","company":"SpringSource - a division of VMware","talks":[{"title":"Increasing developer productivity with Mylyn","event":"Tools in Action","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/39"},{"title":"Spring Data JPA - Repositories done right","event":"Tools in Action","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/544"}],"imageURI":"https://cfp.devoxx.com/static/images/54/thumbnail.gif","firstName":"Oliver"},{"id":985,"lastName":"Gill","bio":"Brendan McAdams is a software engineer at 10gen, where he maintains and supports the Java driver, as well as providing support for alternative JVM languages. He is currently developing a Hadoop integration plugin for MongoDB. Brendan's open source work related to MongoDB includes contributions to MongoKit, a Python object mapper for MongoDB as well as the creation of beaker_mongodb, a MongoDB persistence layer for the popular Python-based Beaker caching system. Brendan also created Casbah, a Scala toolkit for MongoDB.","company":"10gen","talks":[{"title":"Building Web Applications with MongoDB","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/643"}],"imageURI":"https://cfp.devoxx.com/img/thumbnail.gif","firstName":"Meghan"},{"id":229,"lastName":"Giudici","bio":"Fabrizio Giudici is a Senior Java Architect with a long Java experience in the industrial field. Fabrizio has been running Tidalwave.it, his own consultancy company, since 2001 and has been a technical speaker at JavaOne, JavaPolis, Jazoon, Jini Community Meetings and some italian Java conferences. He started working with Java since the old 1.0 times and after 1.3 he has been committed in demonstrating that Java performance is not an issue, really. After bringing Java to the world of Formula One telemetry, he believes he is on the right path. Today he's often helping customers in picking the right architecture, creating the best design and setting up the proper software factory for their products and services. Fabrizio is a member of the JUG Milano and the NetBeans Dream Team.","company":"Tidalwave s.a.s.","talks":[{"title":"Building Android apps with Maven","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/862"}],"imageURI":"https://cfp.devoxx.com/static/images/229/fabrizio-giudici.jpg","firstName":"Fabrizio"},{"id":1020,"lastName":"Gos","bio":"Anna Gos is an all-around software engineer, working primarily in Java. Since year 2006 she has worked for different clients,ranging from large internationals to public sector organization and local businesses. She is a big enthusiast of CQRS architecture  and Neo4j graph database. Beside day-to-day development she is strongly involved in Duchess organization, a global platform for female Java developers.","company":"JTeam B.V.","talks":[{"title":"Women in Java an unconference","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/453"}],"imageURI":"https://cfp.devoxx.com/static/images/1020/","firstName":"Anna"},{"id":306,"lastName":"Gosling","bio":"James Gosling received a B.Sc in Computer Science from the University of Calgary. In 1983, he earned a Ph.D in Computer Science from Carnegie Mellon University, and his doctoral thesis was titled \"The Algebraic Manipulation of Constraints\". While working towards his doctorate, he wrote a version of emacs (gosmacs), and before joining Sun Microsystems he built a multi-processor version of Unix while at Carnegie Mellon University, as well as several compilers and mail systems.\r\n\r\nBetween 1984 and 2010, Gosling was with Sun Microsystems. He is known as the father of the Java programming language. On April 2, 2010, Gosling left Sun Microsystems which had recently been acquired by the Oracle.","company":"na","talks":[{"title":"Fireside Chat","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/918"}],"imageURI":"https://cfp.devoxx.com/static/images/306/thumbnail.gif","firstName":"James"},{"id":622,"lastName":"Grégoire","bio":"Software Architecture and Agility are my current main centers of interest, as levers allowing me to simplify I.T. not only for my own sake but also for my fellow coworkers, and for projects stakeholders.\r\n\r\nDuring the 10 years of my IT career, I've had the possibility to gradually take a few more steps back in order to see the big picture.\r\n\r\nI now try to leverage the best from what I've learned in order to (hopefully) achieve neat design and insightful software. On the side I participate and have started various Open-source projects, and occasionally give some training.","company":"na","talks":[{"title":"Javascript REDUX","event":"Quickie","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/532"}],"imageURI":"https://cfp.devoxx.com/static/images/622/","firstName":"Pierre-Antoine"},{"id":394,"lastName":"Grunwald","bio":"Gerrit Grunwald is working as a team leader of a small group of software developers at Raith GmbH, where he work for around 10 years. His technical interests include desktop software development, preferably using modern, object-oriented and/or component based techniques, and specifically the subareas - Java Swing component development, HTML5 canvas and svg.\r\nHe's a decent-frequency blogger and the leader of the Java User Group in Münster (Germany), where he's living. In addition he is the author of the SteelSeries Java Swing component library and it's javascript counterpart.\r\nHe has been involved in the IT industry since 1996, when he started studying Applied Physics at the University of Applied Sciences Münster (Germany). In 2001, he joined Raith where he started to work as an application scientist, but soon started working in the software development group that he's leading now.","company":"Raith GmbH","talks":[{"title":"From Java Swing to HTML5 Canvas","event":"Quickie","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/408"}],"imageURI":"https://cfp.devoxx.com/static/images/394/Gerrit Grunwald_79x110.jpg","firstName":"Gerrit"},{"id":961,"lastName":"Guerin","bio":"Laurent Guérin is National Practice Leader at Sogeti France, specialized in Java and Web technologies. He’s a senior consultant and has over 20 years of experience in the areas of databases, object development, code generation and project management.\r\n\r\nLaurent is the technical lead of the Telosys project (open source project hosted by the OW2 consortium).\r\n\r\nHe is also lecturer, part time professor (University of Nantes), Certified Scrum Master and Open Source supporter.","company":"Sogeti","talks":[{"title":"A pragmatic scaffolding approach to build Java Web Applications in few minutes","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/632"}],"imageURI":"https://cfp.devoxx.com/static/images/961/thumbnail.gif","firstName":"Laurent"},{"id":23,"lastName":"Gupta","bio":"Arun Gupta is a Java evangelist working at Oracle. Arun has over 15 years of experience in the software industry working in the Java(TM) platform and several web-related technologies. In his current role, he works to create and foster the community around Java EE and GlassFish. He has been with the Java EE team since its inception and contributed to all releases. Arun has extensive world wide speaking experience on myriad of topics and loves to engage with the community, customers, partners, and Java User Groups everywhere to spread the goodness of Java.\r\n\r\nHe is a prolific blogger at http://blogs.oracle.com/arungupta with over 1200 blog entries and frequent visitors from all around the world with a cumulative page visits > 1.2 million. He is a passionate runner and always up for running in any part of the world. You can catch him at @arungupta.","company":"Oracle","talks":[{"title":"Building an end-to-end application using Java EE 6 and NetBeans","event":"Hands-on Labs","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/773"}],"imageURI":"https://cfp.devoxx.com/img/thumbnail.gif","firstName":"Arun"},{"id":132,"lastName":"Guy","bio":"Romain Guy is a software engineer at Google. After spending years having fun with large UIs on the desktop and talking about them at conferences, in blogs, magazines and books, Romain decided to go for the small screen and joined the Android project, an Open Source operating system for mobile phones. He's now trying to make mobile phone UIs as fun and exciting as desktop ones.","company":"Google","talks":[{"title":"Android Graphics and Animations","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/126"},{"title":"Dive into Android","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/133"},{"title":"Android Q&A","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/351"},{"title":"Android UI Development: Tips, Tricks, and Techniques","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/389"},{"title":"Android Awesomeness","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/878"},{"title":"Sticky GUIs","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/879"},{"title":"Graphics Goodies in Android","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/880"}],"imageURI":"https://cfp.devoxx.com/static/images/132/thumbnail.gif","firstName":"Romain"},{"id":129,"lastName":"Haase","bio":"Chet is a graphics geek. He has worked across the industry on various platforms and technologies that put the pixels on the screen. He worked on the Java desktop library at Sun Microsystems, on Java2D, Swing, and animation. He worked on the Flex SDK team at Adobe, writing the effects framework for Flex 4. And he now works at Google on the Android project.\r\nChet is a frequent speaker at conferences such as Devoxx and JavaOne, on topics ranging from graphics to, well, graphics.\r\nChet is the author of the book \"Flex 4 Fun,\" about the graphical and animated side of the Flex 4 SDK.\r\nChet is the co-author, with Romain Guy, of Filthy Rich Clients: Developing Animated and Graphical Effects for Java Desktop applications.\r\nFinally, and irrelevantly, Chet also wrote the book \"When I am King...\", based on his comedy blog writings at http://chetchat.blogspot.com.","company":"Google","talks":[{"title":"Flex 4 Fun","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/119"},{"title":"Android Graphics and Animations","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/126"},{"title":"Dive into Android","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/133"},{"title":"Android Q&A","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/351"},{"title":"Android UI Development: Tips, Tricks, and Techniques","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/389"},{"title":"Android Awesomeness","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/878"},{"title":"Sticky GUIs","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/879"},{"title":"Graphics Goodies in Android","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/880"}],"imageURI":"https://cfp.devoxx.com/static/images/129/thumbnail.gif","firstName":"Chet"},{"id":928,"lastName":"Haleby","bio":"Johan Haleby is a Swedish developer, speaker, and writer with a profound interest in software engineering and testability in particular. He has founded and contributed to numerous open source projects such as PowerMock, REST Assured and Awaitility and has spoken at conferences and user groups in Sweden and Denmark.","company":"Jayway","talks":[{"title":"Stop sleeping, start awaiting!","event":"Quickie","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/568"}],"imageURI":"https://cfp.devoxx.com/img/thumbnail.gif","firstName":"Johan"},{"id":1008,"lastName":"Heinrichs","bio":"Michael Heinrichs has been part of the JavaFX development team right from its early days in 2008. During the early access phase until the release of JavaFX 1.0, he was part of the JavaFX Compiler team. After that he joined the JavaFX Mobile team where he was mainly responsible for performance tuning. In 2010 he became the technical lead for the core components of JavaFX:  JavaFX Beans and Properties, the Binding API, the new collections and the Animation API.","company":"Oracle","talks":[{"title":"JavaFX Properties & Bindings for Experts (and those who want to become experts)","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/692"},{"title":"Animation: Bringing your User Interfaces to Life","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/693"},{"title":"Complete guide to writing custom bindings in JavaFX 2.0","event":"Quickie","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/694"}],"imageURI":"https://cfp.devoxx.com/img/thumbnail.gif","firstName":"Michael"},{"id":978,"lastName":"Heremans","bio":"Frederik is a Software Engineer at Alfresco, working as a core developer on the Activiti BPM engine. Before joining Alfresco, he was active as a JEE consultant, working in high-profile and demanding environments. Later on his focussed shifted towards ECM. He is an enthusiast of the Open Source eco-system, which he believes is the true and only way how software should be created.","company":"Alfresco","talks":[{"title":"Activiti and Vaadin, A match made in heaven","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/630"}],"imageURI":"https://cfp.devoxx.com/static/images/978/foto-frederik-devoxx.jpg","firstName":"Frederik"},{"id":980,"lastName":"Holmström","bio":"Petter Holmström has been working for Vaadin Ltd since October 2009. He currently works as a software architect, specializing in integrating the Vaadin Framework with different backend technologies. His primary interests are software architectures in general, distributed software systems, service oriented applications and different ways of storing data. He holds a master of science degree in computer technology.","company":"Vaadin Ltd","talks":[{"title":"Activiti and Vaadin, A match made in heaven","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/630"}],"imageURI":"https://cfp.devoxx.com/static/images/980/","firstName":"Petter"},{"id":767,"lastName":"Huss","bio":"Roland Huss is a software architect and head of research and development at ConSol Software, a consulting company focused on Java development and IT services. He has been developing in Java for fifteen years but never forgot his roots as system administrator and keeps a strong focus on  manageability of his projects.\r\n\r\nRoland is the lead of the Jolokia project and loves chili pepper as much as JMX.","company":"ConSol","talks":[{"title":"Jolokia - JMX on Capsaicin","event":"Tools in Action","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/484"}],"imageURI":"https://cfp.devoxx.com/static/images/767/roland.gif","firstName":"Roland"},{"id":238,"lastName":"Hüttermann","bio":"Dipl.-Wirt.-Inf. Michael Hüttermann (Java Champion, SCJA, SCJP, SCJD, SCWCD) is freelance developer, architect, coach, author and tutor for Java/JEE, ALM/SCM and agile software development. He speaks at international conferences, was responsible stage producer of the tooling track of Agile 2009, is driver of the Java User Group Cologne, java.net JUGs Community Leader, member of Agile Alliance, in board of the JetBrains Academy, committer to FEST as well as Java contributor. His work-life-balance also consists of writing books and articles. Further information: http://huettermann.net.","company":"Systemtechnologie Hüttermann","talks":[{"title":"Agile ALM in a nutshell","event":"Quickie","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/399"},{"title":"Pimp your ALM, with task-based development","event":"Tools in Action","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/486"},{"title":"Meet Agile ALM: Agile Application Lifecycle Management","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/487"}],"imageURI":"https://cfp.devoxx.com/static/images/238/thumbnail.gif","firstName":"Michael"},{"id":1081,"lastName":"Hyndman","bio":"Richard is a Developer Advocate for Android at Google in the UK. He has enjoyed over 10 years in the mobile industry, including experience running a VC funded mobile start up, working for a large mobile operator and a few years consulting. With his J2ME and XHTML years behind him, Richard now supports Android developers bringing excellent apps to the Android Market.","company":"Google","talks":[{"title":"Android Market for Developers","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/909"},{"title":"Whatʼs new and important in Android","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/910"}],"imageURI":"https://cfp.devoxx.com/static/images/1081/thumbnail2.gif","firstName":"Richard"},{"id":299,"lastName":"Ibsen","bio":"Claus Ibsen is a software engineer and integration specialists from FuseSource, the open source division of Progress Software. Claus is project lead on the open source integration framework Apache Camel (http://camel.apache.org) and co-author of the \"Camel in Action\" book (http://www.manning.com/ibsen).\r\n\r\nClaus is the most active contributor to Apache Camel and is very active in the Camel community. He hang out on the Camel mailing lists, irc-room and often blogs about Camel.\r\n\r\nAt FuseSource he leads the development of Camel and provides consulting and support to customers.\r\nClaus is frequent speaker at FuseSource community day events on subjects related to Camel.\r\n\r\nPrior to joining Progress Software, Claus has worked with integration in all sorts for the last decade.","company":"FuseSource","talks":[{"title":"Apache Camel, a powerful open source integration framework","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/356"},{"title":"Introduction to Apache ActiveMQ, ServiceMix, Camel and CXF","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/874"},{"title":"Hands on with Apache ActiveMQ, ServiceMix, Camel and CXF","event":"Hands-on Labs","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/875"}],"imageURI":"https://cfp.devoxx.com/static/images/299/thumbnail.gif","firstName":"Claus"},{"id":2,"lastName":"Janssen","bio":"If knowledge is power, then knowledge sharing is empowerment.","company":"Devoxx","talks":[{"title":"The annual Java User Group BOF","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/319"},{"title":"Welcome and Intro","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/332"},{"title":"What's new in Parleys.com Version 4","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/353"},{"title":"test","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/403"},{"title":"The annual Java User Group BOF","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/896"},{"title":"Welcome and Announcements","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/925"}],"imageURI":"https://cfp.devoxx.com/static/images/2/thumbnail.gif","firstName":"Stephan"},{"id":142,"lastName":"Kabanov","bio":"Jevgeni Kabanov is the founder and CTO of ZeroTurnaround (www.zeroturnaround.com), a development tools company that focuses on productivity. He wrote the first version of the ZeroTurnaround flagship product, JRebel, a class-reloading JVM plugin.\r\n\r\nJevgeni has been speaking at international conferences for over 5 years, including JavaPolis/Devoxx, JavaZone, JAOO, QCon, TSSJS, JFokus and so on. He has an active research interest in programming languages, types and virtual machines, publishing several papers on topics ranging from category theoretical notions to typesafe Java DSLs.\r\n\r\nJevgeni is on the Expert Group for the JSR 342 (Java EE 7). He has started two open-source projects -- Aranea and Squill. You can follow Jevgeni on Twitter as @ekabanov. See http://lanyrd.com/people/ekabanov/ for conference history and schedule.","company":"ZeroTurnaround OÜ","talks":[{"title":"Instant Updates and Rollbacks in Production Applications","event":"Quickie","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/140"},{"title":"Too much email? Track your project, app and team with Twitter!","event":"Quickie","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/734"}],"imageURI":"https://cfp.devoxx.com/img/thumbnail.gif","firstName":"Jevgeni"},{"id":26,"lastName":"Kalali","bio":"Masoud Kalali has been working on software development projects since 1998. He has experience with  variety of technologies on diverse platforms. His experience is in software architecture, design, and server-side development. Masoud has published several articles at Java.net and DZone. He is also author of GlassFish Security book which covers GlassFish v3 security and Java EE 6 security. Masoud is member of the JMS 2.0 expert group.","company":"Informatics Matters","talks":[{"title":"What's Coming in Java Message Service 2.0","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/890"}],"imageURI":"https://cfp.devoxx.com/static/images/26/thumbnail.gif","firstName":"Masoud"},{"id":617,"lastName":"Karlsson","bio":"Mattias spends most of his time working with software development in the financial sector as well as leading a Java User Group in Stockholm, Sweden. The JUG holds 8-10 fully booked meetings per year with more then 200 participants at every meeting. Mattias has worked with OO software development since 1993. Through the years he has gained experience from many different roles, including developer, architect, team leader, coach, manager, and teacher. Mattias also wrote a chapter in the \"97 Things Every Programmer Should Know\" about Code Reviews\r\n\r\nIn his spare time, Mattias can be found playing with his children or riding his motorcycle, as well as changing underprivileged people's lives by building houses with Habitat for Humanity. Mattias leads a JUG Kiva team. Kiva is a person to person micro-loan organization. Join his effort to improve the world at http://www.kiva.org/team/jug.","company":"Avega Group","talks":[{"title":"Code Reviews - 1 Thing Every Programmer Should Know","event":"Quickie","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/561"}],"imageURI":"https://cfp.devoxx.com/static/images/617/MattiasKarlssonDevoxx.jpg","firstName":"Mattias"},{"id":1031,"lastName":"Khan","bio":"I joined JBoss in 2004 and am a Principal Software Engineer at JBoss by Red Hat. In my time at JBoss I've lead the JBoss AOP project, and the other main JBoss teams I have been a part of have been: EJB 3.0, JBoss Microcontainer, and currently JBoss Application Server 7.","company":"JBoss by Red Hat","talks":[{"title":"JBoss Application Server 7 - Community BOF","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/678"}],"imageURI":"https://cfp.devoxx.com/static/images/1031/100by100.jpg","firstName":"Kabir"},{"id":1083,"lastName":"Kinlan","bio":"Paul is a Developer Advocate on Google Chrome and he focuses on HTML5, open web technologies and the Chrome Web Store. He is passionate about working closely with developers to help them bring awesome applications to the web (because that is the future). Prior to Google he used to earn a living off building apps that used Google's Infrastructure - and whilst he wasn't doing that he built Fraud Detection applications for the worlds largest telecoms, banking and insurance companies.","company":"Google","talks":[{"title":"These Aren't the Sites You're Looking For: Modern HTML5 Web Apps","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/911"},{"title":"Bleeding Edge HTML5","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/912"},{"title":"Next-gen web apps with Web Intents","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/914"}],"imageURI":"https://cfp.devoxx.com/static/images/1083/thumbnail.gif","firstName":"Paul"},{"id":166,"lastName":"Knutsen","bio":"JBoss, Red Hat - Arquillian project lead Aslak Knutsen is currently a Senior Software Engineer at JBoss, by Red Hat where he is working on projects such as Arquillian, ShrinkWrap, Weld and Seam 3, one of the founders of the JBoss Testing initiative and a speaker at major industry conferences including Devoxx, Jazoon, JFokus, Geecon, JUDCon and JBoss World. Previously, Aslak was a Senior Consultant at Conduct AS (working with JBoss related technologies) and Senior Developer at EDB ASA (working with electronic billing/banking systems).","company":"Red Hat","talks":[{"title":"Arquillian - The Extendable Enterprise Test Platform","event":"Tools in Action","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/627"}],"imageURI":"https://cfp.devoxx.com/static/images/166/","firstName":"Aslak"},{"id":6,"lastName":"Laforge","bio":"Guillaume Laforge is the project lead of Groovy, the highly popular and successful dynamic language for the JVM. He co-authored Manning's best seller \"Groovy in Action\" with Dierk König, and is working for SpringSource (a division of VMWare) where he's hacking full time on cool and Groovy stuff. You can meet Guillaume at conferences around the world where he evangelizes the Groovy dynamic language, Domain-Specific Languages in Groovy, the agile Grails web framework or the Gaelyk lightweight toolkit for Google App Engine.","company":"SpringSource","talks":[{"title":"Groovy update, ecosystem, and skyrocketing to the cloud with App Engine and Gaelyk!","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/284"},{"title":"Groovy/Grails Get Together","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/350"},{"title":"What's new in Groovy 1.8 and beyond?","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/448"},{"title":"Cloud is such stuff as dreams are made on","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/899"}],"imageURI":"https://cfp.devoxx.com/static/images/6/thumbnail.gif","firstName":"Guillaume"},{"id":1024,"lastName":"Lahoda","bio":"Jan Lahoda is a software engineer at Oracle, working on the Java language support in the NetBeans IDE.","company":"Oracle Czech","talks":[{"title":"Jackpot 3.0 - Large scale custom refactorings made easy","event":"Tools in Action","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/767"}],"imageURI":"https://cfp.devoxx.com/img/thumbnail.gif","firstName":"Jan"},{"id":189,"lastName":"Landman","bio":"","company":"JFrog Ltd.","talks":[{"title":"Meet Agile ALM: Agile Application Lifecycle Management","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/487"}],"imageURI":"https://cfp.devoxx.com/img/thumbnail.gif","firstName":"Yoav"},{"id":37,"lastName":"Leau","bio":"Costin is a senior software engineer at SpringSource, VMware. His interests include data access and aspect oriented programming.\r\nWith significant development experience, Costin is involved in the development of Spring framework, Pitchfork, Spring Modules and Spring JavaConfig. Leads Spring Dynamic Modules (Spring OSGi) project and the Spring-inspired, OSGi 4.2 Blueprint Service RI.\r\n\r\nSpeaker at various editions of EclipseCon/OSGi DevCon, Javapolis, JavaZone, SpringOne, SpringOne2GX, TSSJS, TSE on Java/Spring/OSGi related topics.","company":"SpringSource, division of VMware","talks":[{"title":"Spring 3 Java Config","event":"Quickie","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/28"},{"title":"Standard DI with @Inject and JSR-330","event":"Quickie","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/29"},{"title":"Improve the performance of your Spring app","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/180"},{"title":"Productivity Enhancements in Spring 3.1","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/682"}],"imageURI":"https://cfp.devoxx.com/static/images/37/thumbnail.gif","firstName":"Costin"},{"id":240,"lastName":"Lehtinen","bio":"Joonas Lehtinen is one of the core developers of Vaadin, a Java-based framework for building business-oriented Rich Internet Applications (RIAs). Joonas has been developing applications for the web since 1995 with a strong focus on Ajax and Java. He is the founder and CEO of Vaadin Ltd.","company":"Vaadin Ltd.","talks":[{"title":"Vaadin - Rich Web Applications in Java without Plug-ins or JavaScript","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/261"},{"title":"Vaadin Meetup","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/917"}],"imageURI":"https://cfp.devoxx.com/static/images/240/thumbnail.gif","firstName":"Joonas"},{"id":39,"lastName":"Leroux","bio":"Nicolas Leroux is a senior architect and Technical Director at Lunatech, having joined in 2001. Nicolas is an expert early adopter of the Java Enterprise platform as well as the open-source technologies that gravitate around it. He applies this experience and technical expertise of the middleware platform on Lunatech's projects and for Lunatech's clients Nicolas is also an open source enthousiast and more specifically a Java enthusiast. He is the co-founder of the Benelux JBoss User Group and the Riviera Java User Group . He also contributes to the open source frameworks he uses by committing patches. Since 2009, Nicolas has had a passion for the Play framework and is now a core developer of its open-source project.","company":"Lunatech Research","talks":[{"title":"Let's Play! with Scala","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/667"}],"imageURI":"https://cfp.devoxx.com/static/images/39/thumbnail.gif","firstName":"Nicolas"},{"id":1063,"lastName":"LeRoux","bio":"Brian LeRoux is the lead software architect at Nitobi Inc. where he\r\nfocuses on delivering web and mobile apps and helping developers all\r\nover the world write their apps. He is a contributor to the popular\r\nPhoneGap open source framework and is the creator of XUI and\r\nLawnchair. Suffice to say, Brian believes that the future of the Web\r\nis mobile and will depend on web standards, open source and hackers,\r\nlike you.","company":"Nitobi","talks":[{"title":"PhoneGap for Hybrid App Development","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/868"}],"imageURI":"https://cfp.devoxx.com/static/images/1063/thumbnail.gif","firstName":"Brian"},{"id":818,"lastName":"Liu","bio":"Rafael Liu has a BS in Computer Science and works with Java since 2005, having worked in software development as a engineer and architect, as well as in consultancy field with middlewares in this platform. Currently he is working for Red Hat Brazil, where he is specialist in Enterprise Portals and SOA solutions of JBoss stack. He is an Oper Source enthusiast and a Linux fan.","company":"Red Hat","talks":[{"title":"Make it test-driven with CDI!","event":"Quickie","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/590"}],"imageURI":"https://cfp.devoxx.com/static/images/818/P13006162.JPG","firstName":"Rafael"},{"id":921,"lastName":"Long","bio":"Josh Long is the Spring developer advocate. Josh is the author of Apress’ Spring Recipes, 2nd Edition, and Pro Spring Integration, and a SpringSource committer and contributor. When he's not hacking on code, he can be found at the local Java User Group or at the local coffee shop. Josh likes solutions that push the boundaries of the technologies that enable them. His interests include scalability, BPM, grid processing, mobile computing and so-called \"smart\" systems. He blogs at blog.springsource.org or joshlong.com.","company":"SpringSource","talks":[{"title":"Socializing Your Spring Applications","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/556"},{"title":"The Quickie Prototype, or, Getting the Job Done Before Lunch","event":"Quickie","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/560"},{"title":"Spring into the Cloud","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/562"}],"imageURI":"https://cfp.devoxx.com/static/images/921/thumbnail.gif","firstName":"Josh"},{"id":380,"lastName":"Luck","bio":"Greg founded Ehcache in 2003. He regularly speaks at conferences, writes and codes. He has also founded and maintains the JPam and Spnego open source projects, which are security focused. Prior to joining Terracotta in 2009, Greg was Chief Architect at Wotif.com where he provided technical leadership as the company went from a single product startup to a billion dollar public company with multiple product lines. Before that Greg was a consultant for ThoughtWorks with engagements in the US and Australia in the travel, health care, geospatial, banking and insurance industries. Before doing programming, Greg managed IT. He was CIO at Virgin Blue, Tempo Services, Stamford Hotels and Resorts and Australian Resorts. He is a Chartered Accountant, and spent 7 years with KPMG in small business and insolvency. \r\nGreg holds a Bachelor of Commerce and a Masters in Information Technology.","company":"Terracotta","talks":[{"title":"The essence of Caching","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/391"},{"title":"JSR107—What the New Java Caching Standard Has in Store For You","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/858"}],"imageURI":"https://cfp.devoxx.com/static/images/380/thumbnail2.gif","firstName":"Greg"},{"id":814,"lastName":"Markus","bio":"Mircea Markus has joined JBoss's clustering team in 2007 as a core engineer. He has been working on various clustering components, such as JBossCache, PojoCache or JGoups. He is one of the founders of Infinispan project on on which he has been concentrating his efforts for the last three years. He has also the founder of project Radargun - a benchmarking framework data grids.","company":"redhat","talks":[{"title":"Real-world deep-dive into Infinispan - the open source data grid platform","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/442"}],"imageURI":"https://cfp.devoxx.com/img/thumbnail.gif","firstName":"Mircea"},{"id":1089,"lastName":"Martignole","bio":"Nicolas Martignole is a freelance, blog author of \"le Touilleur Express\" and a member of the Paris JUG team.\r\nAfter 4 years in startups, 6 years in the financial industry, he started to work as a freelance in 2008. He shares his time between the web application development for its clients and the organization of the events of Paris JUG. He is a Play! Framework Evangelist since end of 2009, and did a lot of presentation with the Play! Framework development team.","company":"Le Touilleur Express","talks":[{"title":"Let's Play! with Scala","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/667"}],"imageURI":"https://cfp.devoxx.com/static/images/1089/thumbnail.gif","firstName":"Nicolas"},{"id":111,"lastName":"Mihajlovski","bio":"Nikolche Mihajlovski is a software developer, architect and engineer who always seeks for improvements of the commonly established processes, practices and technologies. He has over 14 years of programming experience in various programming languages, paradigms and technologies, diverging from experimental research and pet projects to serious enterprise applications. His main fields of interest include Programming Languages, Software Engineering and Cloud Computing.\r\nNikolche is the author of JAnnocessor, a modern technology for annotation-based code generation and validation, as well as RDXPL, an experimental multi-paradigm dynamic programming language. He is an active member of the local Java User Group.","company":"Tricode","talks":[{"title":"JAnnocessor - Innovative Annotation-Based Code Generator","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/771"}],"imageURI":"https://cfp.devoxx.com/static/images/111/nikolce2.png","firstName":"Nikolche"},{"id":15,"lastName":"Miller","bio":"Alex Miller is a Senior Engineer with Revelytix, building federated semantic web query technology. Prior to Revelytix, Alex was technical lead at Terracotta, an engineer at BEA Systems, and Chief Architect at MetaMatrix. His interests include Java, concurrency, distributed systems, languages, and software design. Alex enjoys tweeting as @puredanger and blogging at http://tech.puredanger.com. In St. Louis, Alex is the founder of the Strange Loop developer conference and the Lambda Lounge group for the study of functional and dynamic languages. He likes nachos.","company":"Revelytix","talks":[{"title":"Stream Execution with Clojure and Fork/Join","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/699"}],"imageURI":"https://cfp.devoxx.com/img/thumbnail.gif","firstName":"Alex"},{"id":902,"lastName":"Moulliard","bio":"Ir. Charles Moulliard is a Senior Solution Architect with more than 15 years of expertise in design of solution based on J2EE / .NET technologies. As an architect, he has been involved in system integration of client projects in Financial and Banking world. The skills (Methodology, UML, RUP, Project Management - Prince2, Telecommunication, Network, Security, Perl, Java, c#, CORBA, Web Development, RDBMS, Middleware) that he acquires during its career path have help him to address business, functional, security and infrastructure requirements and transpose them into operable and efficient solutions. He is also fascinated to train people on new emerging technologies like SOA, OSGI and ESB and provide consultancy for FUSE clients. As an Apache Committer he contributes since several years on the projects Apache Camel, Karaf and ServiceMix and uses those technologies as standards for integration project.","company":"Progress","talks":[{"title":"Introduction to Apache ActiveMQ, ServiceMix, Camel and CXF","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/874"},{"title":"Hands on with Apache ActiveMQ, ServiceMix, Camel and CXF","event":"Hands-on Labs","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/875"}],"imageURI":"https://cfp.devoxx.com/static/images/902/thumbnail.gif","firstName":"Charles"},{"id":182,"lastName":"Moussine-Pouchkine","bio":"Java EE and GlassFish developer advocate at Sun Microsystems (soon-to-be Oracle)","company":"Sun Microsystems","talks":[{"title":"Java EE 6 Tutorial. Reloaded!","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/134"},{"title":"The future of the GlassFish community","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/177"},{"title":"From zero to Java EE 6 in 30 minutes and zero slides","event":"Tools in Action","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/179"},{"title":"The JavaEE BOF","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/354"},{"title":"Building an end-to-end application using Java EE 6 and NetBeans","event":"Hands-on Labs","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/773"},{"title":"GlassFish, 2 years into Java EE 6 at Oracle (real-world use-cases included)","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/915"},{"title":"Java EE Gathering","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/922"}],"imageURI":"https://cfp.devoxx.com/static/images/182/thumbnail.gif","firstName":"Alexis"},{"id":295,"lastName":"Muir","bio":"Pete Muir leads the JSR-346 (CDI 1.1) specification, and works on Infinispan (an open source data-grid written in Java). Previously, Pete led the development of Seam 2, Weld 1 projects, and founded the Arquillian and Seam 3 projects. Pete has worked on a number of past specifications including JSF 2.0, AtInject 1.0 and CDI 1.0, and is currently working on JSR-107 (Java Cache API), JSR-347 (Data Grids for the Java Platform) and JSR-345 (EJB 3.2).\r\n\r\nPete is a regular speaker at JUGs and conferences such as Devoxx, JAX, JavaBlend, JSFDays and JUDCon, and JBoss World.\r\n\r\nPete is currently employed by Red Hat Inc. working on JBoss open source projects.","company":"Red Hat, Inc.","talks":[{"title":"Seam 3: State of the Union","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/278"},{"title":"Seam Gathering","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/349"},{"title":"Real-world deep-dive into Infinispan - the open source data grid platform","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/442"},{"title":"CDI, what comes next?","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/622"},{"title":"Java EE Gathering","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/922"}],"imageURI":"https://cfp.devoxx.com/static/images/295/thumbnail.gif","firstName":"Pete"},{"id":1094,"lastName":"Muller","bio":"Marian Muller is a software engineer at Serli (based in France), involved in the development of open-source Java EE servers GlassFish and JOnAS. He is also particularly interested in software security matters.","company":"SERLI","talks":[{"title":"GlassFish :  Application versioning and high-availability rolling upgrade","event":"Tools in Action","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/928"}],"imageURI":"https://cfp.devoxx.com/static/images/1094/","firstName":"Marian"},{"id":1069,"lastName":"Murray","bio":"Current Roles:\r\n\tTechnical Director at encription limited.  A CESG CHECK Green Light company providing penetration testing services to Government, the nuclear industry as well as MoD clients.\r\n\r\n\tDirector of the TigerScheme, secretary to the Technical Panel, member of the management committee and soon to succeed as Chair of the Technical Panel.  \r\n\r\n“The Tiger Scheme provides a means of independently certifying the skills of vulnerability test (penetration test) engineers.  Our qualifications and memberships are graduated and progressive, ranging from Associate Membership to the Senior Security Tester qualification which has been assessed by CESG as equivalent to the CHECK Team Leader Assault Course.”\r\n\r\n\t44con [ www.44con.com ] crew and industry liaison officer.","company":"Encription Limited","talks":[{"title":"Meh!  It's only cross site scripting what's the big deal?","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/877"}],"imageURI":"https://cfp.devoxx.com/img/thumbnail.gif","firstName":"Cambell"},{"id":874,"lastName":"Muurimaa","bio":"Henri Muurimaa has been a professional developer and team leader since 1997, and over the years he has used many Java technologies and tools in several projects of various scopes and sizes. Lately he has been exploring Scala and how to use it to build desktop-like rich internet applications. He has been a member of the Vaadin team since 2002.","company":"Vaadin Ltd","talks":[{"title":"Using Vaadin to create HTML5-enabled web apps in pure Scala","event":"Tools in Action","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/519"}],"imageURI":"https://cfp.devoxx.com/static/images/874/thumbnail.gif","firstName":"Henri"},{"id":1060,"lastName":"Nilson","bio":"Kevin is a Java Champion and speaker at Conferences such as JavaOne, Devoxx, JAX, and AjaxWorld. Kevin is the author of Web 2.0 Fundamentals. Kevin is the leader of the Silicon Valley Web Developer Java User Group, Silicon Valley Google Technology User Group and Silicon Valley JavaScript Meetup. When not busy working with the community Kevin is a Principal Architect at E*Trade Financial.","company":"E*Trade Financial","talks":[{"title":"Moving to the Client - JavaFX and HTML5","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/836"}],"imageURI":"https://cfp.devoxx.com/static/images/1060/Kevin.jpg","firstName":"Kevin"},{"id":1062,"lastName":"Norbye","bio":"Tor Norbye is an engineer on the Android SDK team working on visual tools for Android development. Prior to Google he worked on tools for 14 years at Sun Microsystems.","company":"Google","talks":[{"title":"Java Posse Live","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/772"},{"title":"Android Development Tools","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/897"},{"title":"Android Tools in Action","event":"Tools in Action","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/898"},{"title":"Android Tools BOF","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/906"}],"imageURI":"https://cfp.devoxx.com/static/images/1062/thumbnail.gif","firstName":"Tor"},{"id":298,"lastName":"Nuxoll","bio":"Joe is best known in the software technology world as a co-host of the popular podcast \"The Java Posse\".  By day, Joe is a software architect, user experience designer, race driving instructor, and avid photographer. He previously held significant positions at several top-tier Silicon Valley technology companies including Apple, Sun, Navigenics, Borland, and more than his fair share of startups. Currently Joe is enjoying life as an independent user experience consultant.","company":"The Java Posse","talks":[{"title":"JavaPosse Live","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/338"},{"title":"Java Posse Live","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/772"}],"imageURI":"https://cfp.devoxx.com/static/images/298/thumbnail.gif","firstName":"Joe"},{"id":1088,"lastName":"Oliveira","bio":"Bruno is a Developer Programs Engineer at Google. Based in Sao Paulo, Brazil, he works closely with developers in order to grow and engage the online community around Google developer products, with special emphasis on fostering the involvement of Brazilian developers. His focus areas are Orkut/OpenSocial and Android.","company":"Google","talks":[{"title":"Building Android Applications for Performance and Usability","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/919"}],"imageURI":"https://cfp.devoxx.com/static/images/1088/thumbnail.gif","firstName":"Bruno"},{"id":1061,"lastName":"Orban","bio":"After working for years on transactional systems, Ludovic Orban wrote the Bitronix JTA Transaction Manager. He then joined Terracotta as a software engineer to work on Ehcache and the Quartz enterprise scheduler.","company":"Terracotta","talks":[{"title":"JSR107—What the New Java Caching Standard Has in Store For You","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/858"}],"imageURI":"https://cfp.devoxx.com/static/images/1061/thumbnail.gif","firstName":"Ludovic"},{"id":1078,"lastName":"Osmani","bio":"Addy Osmani is a popular JavaScript Blogger and a UI Developer for AOL based in London, England. He is also a member of the jQuery [Bug Triage/Docs/Front-end] teams where he assists with bugs, documentation and community updates. His free book, ‘Essential JavaScript Design Patterns’ has been downloaded over 130,000 times in the past year and continues to be expanded in his spare time.","company":"AOL","talks":[{"title":"The jQuery Essentials","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/907"}],"imageURI":"https://cfp.devoxx.com/static/images/1078/thumbnail.gif","firstName":"Addy"},{"id":69,"lastName":"Pech","bio":"Václav is a programming enthusiast who's constantly seeking ways to make development more effective and enjoyable. He's particularly interested in server-side Java technologies, distributed systems, parallel programming, agile methodologies, modern programming languages and DSLs.\r\nHe works for JetBrains as a senior software developer and a technology evangelist. On the side, he's leading the GPars project (http://gpars.codehaus.org), an opensource concurrency library, investigates the domains of neural networks, evolutionary programming and data mining.","company":"JetBrains","talks":[{"title":"Groovy actors and concurrent dataflow with GPars","event":"Tools in Action","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/415"}],"imageURI":"https://cfp.devoxx.com/static/images/69/Vaclav_Devoxx.gif","firstName":"Václav"},{"id":355,"lastName":"Pepperdine","bio":"Kirk Pepperdine works as an independent consultant offering Java performance-related services. Prior to focusing on Java, Kirk developed and tuned systems written in C/C++, Smalltalk, and a variety of other languages. Kirk has written many articles and spoken at several conferences on the subject of performance tuning. He helped evolve http://www.javaperformancetuning.com as a resource for performance tuning tips and information.","company":"Kodewerk Ltd","talks":[{"title":"Extending VisualVM","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/390"},{"title":"Are your GC logs speaking to you?","event":"Tools in Action","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/916"}],"imageURI":"https://cfp.devoxx.com/static/images/355/thumbnail.gif","firstName":"Kirk"},{"id":841,"lastName":"Peters","bio":"Sven is software geek working as an ambassador for Atlassian in Germany. He has been developing JavaEE applications for over 11 years and leading small teams using lean methodologies. Sven likes well written and readable source code for keeping legacy code maintainable.","company":"Atlassian","talks":[{"title":"When code gets older – Tips for keeping maintenance projects alive and kicking","event":"Quickie","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/743"}],"imageURI":"https://cfp.devoxx.com/static/images/841/profile.jpg","firstName":"Sven"},{"id":918,"lastName":"Pingel","bio":"Steffen Pingel is a software architect at Tasktop Technologies in beautiful Vancouver, BC. He enjoys working on tools that keep developers focused and productive and regularly speaks at conferences and user groups. He earned commit rights on the Eclipse Mylyn project in 2006 while completing his degree in Software Engineering at the University of Stuttgart. Since, he has become a member of the Eclipse Architecture Council and the Mylyn PMC and now leads several Mylyn sub-projects on Eclipse.org. Steffen is fascinated by the quality and extensibility of the Eclipse platform which keeps inspiring him to improve the Mylyn framework.","company":"Tasktop Technologies","talks":[{"title":"Eclipse Mylyn: Connecting Agile, ALM and the IDE","event":"Tools in Action","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/554"}],"imageURI":"https://cfp.devoxx.com/static/images/918/thumbnail.gif","firstName":"Steffen"},{"id":850,"lastName":"Pollak","bio":"David Pollak founded the Lift Web Framework open source project. Lift is an expressive and elegant framework for writing secure, scalable, interactive web applications on the Java Virtual Machine. David is a consultant in San Francisco.\r\n\r\nDavid also wrote the first real-time spreadsheet and the worlds highest performance spreadsheet engine. As CTO of CMP Media, David oversaw the first large-scale deployment of WebLogic. David was CTO and VP Engineering at Cenzic and helped define best practices for web application security testing.","company":"N/A","talks":[{"title":"Building interactive stuff for real people","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/482"}],"imageURI":"https://cfp.devoxx.com/static/images/850/thumbnail.gif","firstName":"David"},{"id":317,"lastName":"Potts","bio":"Jasper Potts is the Developer Experience Architect for the Java Client Group at Oracle. Responsible for technical design for everything thats sis on the core platform including Controls, Tools, Samples and Blueprints. Formally a lead engineer on the JavaFX & Swing teams working on the new JavaFX UI Controls and Graphics frameworks. Also responsible for designing, developing and presenting demos during the keynotes at JavaOne and Devoxx. A JavaOne Rockstar presenter having presented many sessions on JavaFX and Swing at many conferences. Prior to Sun he founded Xerto a desktop applications company developing Imagery a Java professional photo management application.","company":"Oracle","talks":[{"title":"From Shabby to Chic","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/293"},{"title":"JavaFX","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/295"},{"title":"JavaFX 101","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/296"},{"title":"Physically Attractive","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/398"},{"title":"Java Rich Clients with JavaFX 2.0","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/741"},{"title":"Practical Experience Building JavaFX Rich Clients","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/748"},{"title":"JavaFX Open Mic","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/762"},{"title":"JavaFX 2.0 Hands On","event":"Hands-on Labs","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/764"}],"imageURI":"https://cfp.devoxx.com/static/images/317/PAR-4_01-Jasper-Potts-100x110.png","firstName":"Jasper"},{"id":1087,"lastName":"Purdy","bio":"Cameron Purdy is Vice President of Development at Oracle. Prior to joining Oracle, Mr. Purdy was the CEO of Tangosol, whose revolutionary Coherence Data Grid product provides reliable and scalable data management across the enterprise. Mr. Purdy has been working with Java and Java-related technology since 1996, regularly participates in industry standards development and is a specification lead for the Java Community Process. As a software visionary and industry leader, Mr. Purdy is a frequent presenter at industry conferences and has received a number of awards in recognition of his contribution to the Java community, including three times being named as a JavaOne RockStar and being recognized in TheServerSide's \"Who's Who in Enterprise Java\".","company":"Oracle","talks":[{"title":"Fireside Chat","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/918"}],"imageURI":"https://cfp.devoxx.com/static/images/1087/thumbnail.gif","firstName":"Cameron"},{"id":297,"lastName":"Quinn","bio":"Carl Quinn, member of the JavaPosse","company":"Java Posse","talks":[{"title":"JavaPosse Live","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/338"},{"title":"Java Posse Live","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/772"}],"imageURI":"https://cfp.devoxx.com/static/images/297/thumbnail.gif","firstName":"Carl"},{"id":20,"lastName":"Raible","bio":"Matt Raible has been building web applications for most of his adult life. He started tinkering with the web before Netscape 1.0 was even released. For the last 11 years, Matt has helped companies adopt open source technologies (Spring, Hibernate, Apache, Struts, Tapestry, Grails) and use them effectively. Matt has been a speaker at many conferences worldwide, including ApacheCon, JavaZone, Colorado Software Summit, No Fluff Just Stuff, and a host of others.\r\n\r\nMatt is an author (Spring Live and Pro JSP), and an active \"kick-ass technology\" evangelist on http://raibledesigns.com. He is the founder of AppFuse, a project which allows you to get started quickly with Java frameworks, as well as a committer on the Apache Roller and Apache Struts projects. \r\n\r\nFor the last few years, Matt has served as the UI Architect for high-traffic web sites such as LinkedIn and Evite. He currently serves as the Chief Architect of Web Development at Time Warner Cable.","company":"Raible Designs","talks":[{"title":"Comparing JVM Web Frameworks","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/97"},{"title":"HTML5 with Play/Scala, CoffeeScript and Jade","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/447"}],"imageURI":"https://cfp.devoxx.com/static/images/20/thumbnail.gif","firstName":"Matt"},{"id":153,"lastName":"Reese","bio":"George Reese is the author of several books on cloud computing, Java, and MySQL. His most recent book is O’Reilly’s Cloud Application Architectures. Professionally, he is the founder and CTO of enStratus, the only infrastructure management solution supporting enterprise security and governance for the hybrid cloud. George has also led a number of Open Source projects, including several MUD libraries and the mSQL-JDBC JDBC driver. He is the primary maintainer of Dasein Cloud, a cloud abstraction API for Java.\r\n\r\nGeorge holds a BA from Bates College in Maine and an MBA from the Kellogg School of Management at Northwestern University.","company":"enStratus","talks":[{"title":"Designing Java Systems to Operate at a Cloud Scale","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/155"},{"title":"Dasein Cloud: The JDBC for Cloud Programming","event":"Tools in Action","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/708"}],"imageURI":"https://cfp.devoxx.com/static/images/153/thumbnail.gif","firstName":"George"},{"id":1070,"lastName":"Richards","bio":"Impressed by the cross-platform possibilities of Java 1.0.2, Neil joined IBM's  Java Technology Centre in 1997 to help the industry-wide adoption and  enhancement of Java. He has worked in many areas of the core SDK, including  several years as the lead developer (and team leader) for IBM's Java SE ORB  implementation, providing the core technology underpinning RMI-IIOP and  Java EE EJB. He is now working in OpenJDK to help the platform towards  Programming Nirvana, one step at a time.","company":"IBM","talks":[{"title":"OpenJDK experiences","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/900"}],"imageURI":"https://cfp.devoxx.com/static/images/1070/thumbnail.gif","firstName":"Neil"},{"id":55,"lastName":"Richardson","bio":"Chris Richardson is a developer and architect with over 25 years of experience. He is a Java Champion, a frequent speaker at international software development conferences, and the author of POJOs in Action, which describes how to build enterprise Java applications with POJOs and frameworks such as Spring and Hibernate. Chris is the founder of CloudFoundry.com, which is a Java PaaS, and works at VMware. He has a computer science degree from the University of Cambridge in England and lives in Oakland, CA with his wife and three children.","company":"SpringSource/VMware","talks":[{"title":"NoSQL for Java developers","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/471"},{"title":"Spring into the Cloud","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/562"}],"imageURI":"https://cfp.devoxx.com/static/images/55/","firstName":"Chris"},{"id":7,"lastName":"Rubinger","bio":"Advocate for and speaker on testable enterprise Java development, author of \"Enterprise JavaBeans 3.1\" from O'Reilly Media.  Member of the JBoss Application Server development team and technical lead of the ShrinkWrap project.  Proudly employed by JBoss / Red Hat.","company":"JBoss by Red Hat","talks":[{"title":"7 Reasons to Love AS 7","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/664"},{"title":"JBoss Application Server 7 - Community BOF","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/678"}],"imageURI":"https://cfp.devoxx.com/static/images/7/alrubinger-devoxx.gif","firstName":"Andrew"},{"id":123,"lastName":"Silveira","bio":"Guilherme Silveira works with Java for 10 years, mostly EE technologies and open sources counterparts. Head instructor at Caelum, a brazilian training company, technical editor for the brazilian java magazine \"Mundo Java\" and creator of Restfulie, co-founder of the most accessed and largest online portuguese-speaking java user group, guj.com.br. Currently focuses on aspects of good code and how to write maintainable software in Java, Scala and Ruby.\r\n\r\nAdriano Almeida works with web development, several technologies and architectures. He is an open source developer commiting on Restfulie and VRaptor, teaching and developing at Caelum.","company":"Caelum","talks":[{"title":"Restfulie: quit pretending, use the web for real","event":"Tools in Action","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/125"},{"title":"Hibernate/JPA type safe query in Scala: an implicit help from the language","event":"Tools in Action","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/648"}],"imageURI":"https://cfp.devoxx.com/static/images/123/thumbnail.gif","firstName":"Guilherme"},{"id":268,"lastName":"Smart","bio":"John is an experienced consultant and trainer specialising in Enterprise Java, Web Development, and Open Source technologies, based in Sydney, Australia. Well known in the Java community for his many published articles, and as author of Java Power Tools, John helps organisations around the world to optimize their Java development processes and infrastructures and provides training and mentoring in open source technologies, SDLC tools, and agile development processes. John is CEO of Wakaleo Consulting, a company that provides consulting, training and mentoring services in Enterprise Java and Agile Development. John is the author of 'Java Power Tools' and of the recently published 'Jenkins: The Definitive Guide'","company":"Wakaleo Consulting","talks":[{"title":"Continuous Deployment - automated build pipelines with Maven, Nexus and Hudson","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/302"},{"title":"Jenkins: From Continuous Integration to Continuous Delivery","event":"Tools in Action","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/597"}],"imageURI":"https://cfp.devoxx.com/static/images/268/thumbnail.gif","firstName":"John"},{"id":403,"lastName":"Snaps","bio":"Alex Snaps is a software engineer at Terracota Inc, with significant experience in web application development and highly concurrent systems. Before working on the Terracotta platform and product line, he participated in medium to large projects as coach, development lead and architect. He speaks regularly about Java development at events such as JavaOne, JavaPolis, Devoxx, JavaZone, Jazoon or XP Days as well as JUGs around the globe. He is currently working on Ehcache, the Quartz enterprise scheduler and the Terracotta Toolkit.","company":"Terracotta (a Software AG company)","talks":[{"title":"JSR107—What the New Java Caching Standard Has in Store For You","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/858"}],"imageURI":"https://cfp.devoxx.com/static/images/403/thumbnail.gif","firstName":"Alex"},{"id":1010,"lastName":"Sohn","bio":"Matthias Sohn is co-leading the Eclipse EGit and JGit projects, is a committer on Mylyn Reviews and contributes to Gerrit Code Review. He works at SAP as a scrum product owner in the Java technology area leading a team introducing Git and Gerrit Code Review at SAP. Matthias is passionate about Open Source communities, Open Source tools like Git and Gerrit and the transformational productivity gains they enable.","company":"SAP AG","talks":[{"title":"Code Review with Git and Gerrit","event":"Tools in Action","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/696"}],"imageURI":"https://cfp.devoxx.com/static/images/1010/MatthiasSohn.jpg","firstName":"Matthias"},{"id":859,"lastName":"Soto","bio":"Alex Soto discovered Java during second year of his studies in computer science and wrote his Master's Thesis on Emergent Intelligence applied to Data Mining, winning the second prize of Hermano Salvador González contest. During his 11 years of software development, Alex has worked in several companies as technical consultant, and currently is working as technical analyst at a major international pharmaceutical developing in-vitro medical devices meeting FDA standards. Alex also works as tutor at Open University of Catalonia (UOC), teaching Compilers course. He spends his free time to write in his blog where some posts are published in sites like dzone, theserverside and springsource.","company":"Diagnostic Grifols","talks":[{"title":"Speeding Up Javascript & CSS Download Times With Aggregation and Minification","event":"Quickie","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/569"}],"imageURI":"https://cfp.devoxx.com/static/images/859/devoxx.gif","firstName":"Alex"},{"id":1058,"lastName":"Strachan","bio":"James is heavily involved in the open source community: he's been an Apache committer for 10 years, was one of the founders of the Apache ActiveMQ, Camel and ServiceMix projects, created the Groovy programming language and a number of other open source projects including Scalate, dom4j & Jaxen and is a committer on a number of projects such as Apache Karaf and Jersey. James is currently a Software Fellow at FuseSource and has more than 20 years experience in enterprise software development with a background in finance, consulting and middleware.","company":"FuseSource","talks":[{"title":"Introduction to Apache ActiveMQ, ServiceMix, Camel and CXF","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/874"},{"title":"Hands on with Apache ActiveMQ, ServiceMix, Camel and CXF","event":"Hands-on Labs","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/875"}],"imageURI":"https://cfp.devoxx.com/static/images/1058/thumbnail.gif","firstName":"James"},{"id":120,"lastName":"Surtani","bio":"Manik Surtani is a core R&D engineer at JBoss, a division of Red Hat. He is the founder of the Infinispan project, which he currently leads. He is also the spec lead of JSR 347 (Data Grids for the Java Platform), and represents Red Hat on the Expert Group of JSR 107 (Temporary caching for Java).\r\n\r\nHis interests lie in cloud and distributed computing, autonomous systems and highly available computing. He has a background in artificial intelligence and neural networks, a field he left behind when he moved from academic circles to the commercial world. Since then, he's been working with Java-related technologies, first for a startup focusing on knowledge management and information exchange, and later for a large London-based consultancy as a tech lead focused on e-commerce applications on large Java EE and peer-to-peer technology.\r\n\r\nManik is a strong proponent of open source development methodologies, ethos, and collaborative processes, and has been involved in open source since his first forays into computing.","company":"JBoss by Red Hat","talks":[{"title":"Hacking Infinispan: the new open source data grid meets NoSQL","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/96"},{"title":"Real-world deep-dive into Infinispan - the open source data grid platform","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/442"}],"imageURI":"https://cfp.devoxx.com/static/images/120/thumbnail.gif","firstName":"Manik"},{"id":1064,"lastName":"Swan","bio":"Works at the Spring Roo team in Australia.","company":"VMware","talks":[{"title":"Spring Roo: Instant Productivity","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/895"}],"imageURI":"https://cfp.devoxx.com/static/images/1064/thumbnail.gif","firstName":"Andrew"},{"id":219,"lastName":"ten Bruggencate","bio":"Regina is a senior Java developer for iProfs and a Java Champion, with 10 plus years of Java experience mainly on enterprise applications. Regina is the current president of JDuchess, and as such has the responsibility for the site and community. Duchess is a global organization for women in Java technology, currently with 350 members in over 50 countries. Duchess provides a platform through which women who work with Java can connect with each other and get involved in the greater Java community. It aims to make women's role and the individual women's contributions visible in the Java community and to teach the benefits of diversity in any team environment - whether corporate or open-source.","company":"JDuchess","talks":[{"title":"Women in IT an unconference","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/272"},{"title":"Women in Java an unconference","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/453"}],"imageURI":"https://cfp.devoxx.com/static/images/219/thumbnail.gif","firstName":"Regina"},{"id":1065,"lastName":"Tyrrell","bio":"James Tyrrell is a Software Engineer with VMware and a member of the Spring Roo team. Since joining the team James has worked closely with Google on the GWT add-on, created the Cloud Foundry add-on, and provided a number of core enhancements to Roo. He enjoys getting his hands dirty with advanced code and is currently working on a new type analysis, parsing and generation engine.\r\n\r\nPrior to coming to VMware, James worked extensively with GWT and has developed a number of applications using the technology. He has presented at a number of developer events on topics including Spring Roo, GWT and Cloud Foundry.\r\n\r\nJames can be found on the web at populationjim.com and twitter.com/jimbotyrrell","company":"VMware","talks":[{"title":"Spring Roo: Instant Productivity","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/895"}],"imageURI":"https://cfp.devoxx.com/static/images/1065/thumbnail.gif","firstName":"James"},{"id":284,"lastName":"van Rijn","bio":"Roy van Rijn, a software Craftsman at JPoint (http://www.jpoint.nl). Before starting JPoint, Roy was Java Software Architect at Ordina, working on miscellaneous projects and giving roadshow presentations around the Netherlands. He was also co-author of the book \"Software Ontwikkeling in Java EE\". He has regularly given trainings during his career, including Spring, Sofware Architecture, Testing and Agile/Lean courses. Currently he is involved with the HaMIS project by the Port of Rotterdam. A very succesful Scrum project, which hasn't just changed the development team, but the whole project management structure underneath resulting in a hyper-productive project.","company":"JPoint","talks":[{"title":"What Shazam doesn't want you to know","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/606"}],"imageURI":"https://cfp.devoxx.com/static/images/284/profilePic_devoxx2.gif","firstName":"Roy"},{"id":405,"lastName":"Verburg","bio":"Martijn Verburg (aka 'the Diabolical Developer') herds Cats in the Java/open source communities and is constantly humbled by the creative power to be found there. Currently he resides in London where he co-leads the London JUG (a JCP EC member), runs a couple of open source projects & drinks too much beer at his local pub. You can find him online moderating at the Javaranch or discussing (ranting?) subjects on the Prgorammers Stack Exchange site. Most recently he's become a regular speaker at conferences on Java, open source and software development and has recently wrapped up his first Manning title - \"The Well-Grounded Java Developer\" with his co-author Ben Evans.","company":"N/A","talks":[{"title":"Less annoying Java standards","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/571"},{"title":"The Well-Grounded Java Developer","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/572"}],"imageURI":"https://cfp.devoxx.com/static/images/405/529dd6111421e230eedb34d96a473f85.png","firstName":"Martijn"},{"id":99,"lastName":"Vogel","bio":"Lars Vogel maintains the website vogella.de with many Android and Eclipse related tutorials and with more then 24 000 daily visitors. \r\n\r\nHe works as an independent Android and Eclipse trainer and as employee of SAP AG in the role of a product owner. He is a regular speaker at international conferences, as for example EclipseCon, EclipseSummitEurope, Java Forum Stuttgart, MobilTechCon and Droidcon. \r\n\r\nLars received 2010 the \"Eclipse Top Contributor Award\".","company":"Self","talks":[{"title":"Android Jumpstart - Introduction to Android App development","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/469"}],"imageURI":"https://cfp.devoxx.com/static/images/99/thumbnail.gif","firstName":"Lars"},{"id":272,"lastName":"Wall","bio":"Dick Wall, member of the JavaPosse, Partner with Escalate Software","company":"The Java Posse","talks":[{"title":"What's New in Scala 2.8?","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/318"},{"title":"JavaPosse Live","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/338"},{"title":"Scala","event":"BOF","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/352"},{"title":"Java Posse Live","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/772"},{"title":"Courage in Software Development","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/775"}],"imageURI":"https://cfp.devoxx.com/static/images/272/thumbnail.gif","firstName":"Dick"},{"id":136,"lastName":"Wegrzynowicz","bio":"Patrycja Wegrzynowicz is Founder and CTO at Yonita Inc. and Yon Consulting LLC. There, she shapes the future direction of development of innovative tools to support automated verification, understanding, and optimization of software programs. She is also associated with Warsaw University of Technology, where she serves as Technical Manager of Passim/Synat, an intelligent search engine. She is a regular speaker at top academic (e.g., OOPSLA, ASE) as well as technical conferences (e.g., JavaOne, JavaZone). Patrycja holds a master degree in Computer Science and is currently finalizing her PhD at University of Warsaw. Her research interests are focused on architectural and design patterns and anti-patterns along with automated software engineering, particularly static and dynamic analysis techniques.\r\n\r\nYou can follow her on Twitter at @YonLabs.","company":"Yonita, Inc.","talks":[{"title":"Performance Anti-Patterns in Hibernate","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/820"}],"imageURI":"https://cfp.devoxx.com/static/images/136/pw-web-100x110.jpg","firstName":"Patrycja"},{"id":208,"lastName":"Wielenga","bio":"Geertjan Wielenga is a principal product manager in Oracle for NetBeans and has been a member of the NetBeans Team for the past 7 years.","company":"NetBeans","talks":[{"title":"What's In Your Toolbox for JDK 7?","event":"Tools in Action","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/719"}],"imageURI":"https://cfp.devoxx.com/img/thumbnail.gif","firstName":"Geertjan"},{"id":114,"lastName":"Williams","bio":"James Williams is a developer based in Silicon Valley and frequent conference speaker. He is a co-creator of the Griffon project, a rich desktop framework for Java applications. He and his team WalkIN, created a product on a coach bus while riding to South By Southwest Interactive(SXSWi), and were crowned winners of StartupBus 2011 competition. He is the author of the upcoming book \"Learning HTML5 Game Programming...\" for Addison-Wesley. He blogs at http://jameswilliams.be/blog and tweets as @ecspike.","company":"N/A","talks":[{"title":"Intro to HTML5 Game Development","event":"University","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/870"}],"imageURI":"https://cfp.devoxx.com/static/images/114/thumbnail.gif","firstName":"James"},{"id":1074,"lastName":"Yoon","bio":"John is a member of the JavaFX team. John studied animation at the UCLA Film School, where he received his Master of Fine Arts in Animation/Film. Prior to working at Oracle, John worked in the animation industry as a Character Technical Director at Disney Animation and DreamWorks Animation on such films as \"Chicken Little\", \"Meet the Robinsons\", \"Shrek Forever After\", and \"How to Train Your Dragon\".","company":"Oracle","talks":[{"title":"Animation: Bringing your User Interfaces to Life","event":"Conference","presentationUri":"https://cfp.devoxx.com/rest/v1/events/presentations/693"}],"imageURI":"https://cfp.devoxx.com/static/images/1074/thumbnail.gif","firstName":"John"}]